Repository: apluslms/a-plus
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi

source: Course content configured.
fi: Kurssin sisältöasetukset on päivitetty.

# CONFIGURED_WITH_ERRORS
source: Configuring failed with errors:
fi: Asetusten muuttaminen epäonnistui virheillä:

# CONFIGURE_FAILED
source: Configuring failed!
fi: Asetusten muuttaminen epäonnistui!

# ERROR_SERVER_RETURNED_ERROR -- {error!s}
source: Server returned error '{error!s}'.
fi: Palvelin palautti virheen: '{error!s}'

# EXERCISE_CACHES_CLEARED
source: Assignment caches have been cleared.
fi: Tehtävien välimuisti on tyhjennetty.

source: Real class
fi: Oikea luokka

source: Course instance
fi: Kurssikerta

# LABEL_SUBMITTERS
source: Submitters
fi: Palauttajat

# LABEL_SUBMISSION
source: submission
fi: palautus

# ERROR_SUBMISSION_SAVING_FAILED
source: The submission could not be saved for some reason. The submission was not registered.
fi: Palautuksen tallentaminen epäonnistui. Palautusta ei ole huomioitu.

# ERROR_ALERT_EXERCISE_ASSESSMENT_SERVICE_MALFUNCTIONING
source: <div class="alert alert-error"> <p>The assessment is malfunctioning. Course staff has been notified.</p> <p>This submission is now marked as erroneous.</p> </div>
fi: <div class="alert alert-error"> <p>Tehtävän arviointi on rikki. Kurssin henkilökunnalle on ilmoitettu tästä.</p> <p>Tämä palautus merkittiin epäonnistuneeksi.</p> </div>

# ENROLLMENT_QUESTIONS
source: Enrolment questionnaire
fi: Ilmoittautumiskysely

# ENROLLMENT_QUESTIONS_FOR_EXTERNAL
source: Enrolment questionnaire for external students
fi: Ilmoittautumiskysely ulkopuolisille opiskelijoille

# HIDDEN_FROM_NOT_COURSE_STAFF
source: Hidden from non course staff
fi: Piilotettu muilta kuin kurssin henkilökunnalta

# AUDIENCE_COURSE_AUDIENCE
source: Course audience
fi: Kurssin kohdeyleisö

# AUDIENCE_INTERNAL_USERS
source: Only internal users
fi: Vain oppilaitoksen sisäiset käyttäjät

# AUDIENCE_EXTERNAL_USERS
source: Only external users
fi: Vain oppilaitoksen ulkopuoliset käyttäjät

# AUDIENCE_REGISTERED_USERS
source: Only registered users
fi: Kaikki rekisteröityneet käyttäjät

# LABEL_AUDIENCE
source: audience
fi: kohdeyleisö

# LABEL_CATEGORY
source: category
fi: kategoria

# LABEL_COURSE_MODULE
source: course module
fi: kurssimoduuli

# LABEL_PARENT
source: parent
fi: ylätaso

# LEARNING_OBJECT_URL_IDENTIFIER_HELPTEXT
source: Input an URL identifier for this object.
fi: Syötä URL-osoitteessa käytettävä tunnus tälle kohteelle.

# LEARNING_OBJECT_DESCRIPTION_HELPTEXT
source: Internal description is not presented on site.
fi: Sisäistä kuvausta ei esitetä sivustolla.

# LABEL_USE_WIDE_COLUMN
source: use wide column
fi: käytä leveää saraketta

# LEARNING_OBJECT_WIDE_COLUMN_HELPTEXT
source: Remove the third info column for more space.
fi: Poista kolmas tietopalsta tilan leventämiseksi.

# LABEL_EXERCISE_INFO
source: assignment info
fi: tehtävän tiedot

# LABEL_MODEL_ANSWERS
source: model answers
fi: esimerkkiratkaisut

# LEARNING_OBJECT_MODEL_ANSWER_URLS_HELPTEXT
source: List model answer files as protected URL addresses.
fi: Luettele esimerkkiratkaisujen ei-julkiset URL-osoitteet.

# LABEL_TEMPLATES
source: templates
fi: pohjatiedostot

# LEARNING_OBJECT_TEMPLATE_URLS_HELPTEXT
source: List template files as protected URL addresses.
fi: Luettele pohjatiedostojen ei-julkiset URL-osoitteet.

# MODEL_NAME_LEARNING_OBJECT
source: learning object
fi: oppimissisältö

# MODEL_NAME_LEARNING_OBJECT_PLURAL
source: learning objects
fi: oppimissisällöt

# LEARNING_OBJECT_ERROR_MODULE_AND_CATEGORY_MUST_HAVE_SAME_COURSE_INSTANCE
source: Course_module and category must belong to the same course instance.
fi: Moduulin ja kategorian pitää kuulua samaan kurssikertaan.

# LEARNING_OBJECT_ERROR_PARENT_MUST_BE_FROM_SAME_MODULE
source: Cannot select parent from another course module.
fi: Et voi valita 'Parent'-viitettä toisesta kurssimoduulista.

# LEARNING_OBJECT_ERROR_PARENT_CANNOT_BE_SELF
source: Cannot select self as a parent.
fi: Kohdetta ei voi valita itsensä 'Parent'-viitteeksi.

# LABEL_LEARNING_OBJECT
source: learning object
fi: oppimissisältö

# MODEL_NAME_LEARNING_OBJECT_DISPLAY
source: learning object display
fi: oppimissisällön näyttökerta

# MODEL_NAME_LEARNING_OBJECT_DISPLAY_PLURAL
source: learning object displays
fi: oppimissisältöjen näyttökerrat

# LABEL_GENERATE_TOC
source: generate table of contents
fi: luo sisällysluettelo

# MODEL_NAME_COURSE_CHAPTER
source: course chapter
fi: kurssiluku

# MODEL_NAME_COURSE_CHAPTER_PLURAL
source: course chapters
fi: kurssiluvut

# GRADING_MODE_BEST
source: Best submission
fi: Paras palautus

# GRADING_MODE_LAST
source: Last submission
fi: Viimeinen palautus

# LABEL_ALLOW_ASSISTANT_VIEWING
source: allow assistant viewing
fi: salli assistenttien tarkastelu

# LABEL_ALLOW_ASSISTANT_GRADING
source: allow assistant grading
fi: salli assistenttien arvostelu

# LABEL_MIN_GROUP_SIZE
source: min group size
fi: ryhmän vähimmäiskoko

# LABEL_MAX_GROUP_SIZE
source: max group size
fi: ryhmän enimmäiskoko

# LABEL_MAX_SUBMISSIONS
source: max submissions
fi: palautuskertojen enimmäismäärä

# LABEL_MAX_POINTS
source: max points
fi: enimmäispisteet

# LABEL_DIFFICULTY
source: difficulty
fi: vaikeusaste

# LABEL_SUBMISSION_FEEDBACK_REVEAL_RULE
source: Submission feedback reveal rule
fi: Tehtävien palautteen paljastamissääntö

# LABEL_MODEL_SOLUTIONS_REVEAL_RULE
source: Model solutions reveal rule
fi: Malliratkaisujen paljastamissääntö

# LABEL_GRADING_MODE
source: Grading mode
fi: Arvostelutapa

# BASE_EXERCISE_GRADING_MODE_HELPTEXT
source: Select which submission determines the final grade for this assignment.
fi: Valitse, mikä palautus määrittää lopullisen arvosanan tässä tehtävässä.

# MODEL_NAME_BASE_EXERCISE
source: base assignment
fi: perustehtävä

# MODEL_NAME_BASE_EXERCISE_PLURAL
source: base assignments
fi: perustehtävät

# EXERCISE_ERROR_POINTS_TO_PASS_GREATER_MAX_POINTS
source: Points to pass cannot be greater than max_points.
fi: 'Läpäisyyn vaadittavat pisteet' ei voi olla suurempi kuin 'Enimmäispisteet'.

# EXERCISE_ERROR_MIN_GROUP_SIZE_GREATER_MAX_SIZE
source: The minimum group size cannot exceed the maximum size.
fi: Ryhmän koon alaraja ei voi olla suurempi kuin yläraja.

# EXERCISE_TIMING_LATE -- {date}, {percent:d}
source: The deadline for the assignment has passed. Late submissions are allowed until {date}, but points are only worth {percent:d}% of normal.
fi: Tehtävän määräaika on mennyt. Myöhäisiä palautuksia vastaanotetaan {date} asti, mutta pisteiden arvo on ainoastaan {percent:d}% normaalista.

# EXERCISE_TIMING_UNOFFICIAL -- {date}
source: The deadline for the assignment has passed ({date}). You may still submit to receive feedback, but your current grade will not change.
fi: Tehtävän määräaika on mennyt ({date}). Voit edelleen palauttaa saadaksesi palautetta, mutta nykyinen arvosanasi ei muutu.

# EXERCISE_TIMING_CLOSED_BEFORE -- {date}
source: The assignment opens at {date} for submissions.
fi: Tämän tehtävän voi palauttaa {date} alkaen.

# EXERCISE_TIMING_CLOSED_AFTER -- {date}
source: The deadline for the assignment has passed ({date}).
fi: Tehtävän määräaika on mennyt ({date}).

# EXERCISE_TIMING_ARCHIVED -- {date}
source: This course has been archived ({date}).
fi: Tämä kurssi on arkistoitu ({date}).

# SOMETHING_WENT_WRONG
source: Something went terribly wrong and your request could not be processed. Sorry!
fi: Jokin meni pahasti pieleen, eikä pyyntöäsi onnistuttu käsittelemään. Pahoittelut!

# EXERCISE_MAX_SUBMISSIONS_USED_UNOFFICIAL_ALLOWED
source: You have used the allowed amount of submissions for this assignment. You may still submit to receive feedback, but your current grade will not change.
fi: Olet käyttänyt kaikki tehtävän palautuskerrat. Voit edelleen palauttaa saadaksesi palautetta, mutta nykyinen arvosanasi ei muutu.

# EXERCISE_MAX_SUBMISSIONS_USED
source: You have used the allowed amount of submissions for this assignment.
fi: Olet käyttänyt kaikki tehtävän palautuskerrat.

# CANNOT_ENROLL_IN_COURSE_ERROR
source: You cannot enroll in the course.
fi: Et voi ilmoittautua kurssille.

# STAFF_CAN_SUBMIT_WITHOUT_ENROLLING
source: Staff can submit assignments without enrolling.
fi: Henkilökunta voi palauttaa tehtäviä ilmoittautumatta.

# MUST_ENROLL_TO_SUBMIT_EXERCISES_ERROR
source: You must enroll in the course to submit assignments.
fi: Palauttaaksesi tehtäviä sinun pitää ilmoittautua kurssille.

# EXERCISE_ERROR_CANNOT_SUBMIT_INVALID_JSON_IN_POST
source: Cannot submit assignment because of invalid JSON in POST data
fi: Tehtävää ei voitu palauttaa, POST pyyntö sisälsi virheellistä JSON:nia

# EXERCISE_ERROR_NO_GROUP_WITH_ID
source: No group found with the given ID
fi: Ryhmää ei löytynyt annetulla ID:llä

# EXERCISE_ERROR_GROUP_CANNOT_CHANGE_FOR_SAME_EXERCISE_MSG
source: Group can only change between different assignments.
fi: Ryhmää voi vaihtaa vain eri tehtävien välissä.

# EXERCISE_ERROR_HAS_PREVIOUSLY_SUBMITTED_EXERCISE -- {with_group}, {msg}
source: You have previously submitted this assignment {with_group}. {msg}
fi: Olet palauttanut tämän tehtävän aiemmin {with_group}. {msg}

source: alone
fi: yksin

source: with {}
fi: ryhmässä {}

source: {collaborators} already submitted to this assignment in a different group.
fi: {collaborators} palautti jo tämän tehtävän eri ryhmässä.

# EXERCISE_ERROR_REQUIRES_GROUP_SIZE -- {size}
source: This assignment must be submitted in groups of {size} students.
fi: Tämä tehtävä täytyy palauttaa {size} opiskelijan ryhmässä.

# EXERCISE_ERROR_CANNOT_SUBMIT_UNKNOWN_REASON
source: Cannot submit assignment due to unknown reason. If you think this is an error, please contact course staff.
fi: Tehtävää ei voitu palauttaa tuntemattomasta syystä. Jos uskot tämän olevan virhe, ota ystävällisesti yhteyttä kurssihenkilökuntaan.

# LABEL_LTI_SERVICE
source: LTI service
fi: LTI-palvelu

# LABEL_CONTEXT_ID
source: LTI course key (context ID)
fi: LTI kurssiavain (context id)

# LTI_EXERCISE_CONTEXT_ID_HELPTEXT
source: Default: [domain name]/[course:url]/[instance:url]/
fi: Oletus: [hostname]/[course:url]/[instance:url]/

# LABEL_RESOURCE_LINK_ID
source: LTI assignment key (resource link ID)
fi: LTI tehtäväavain (resource link ID)

# LTI_EXERCISE_RESOURCE_LINK_ID_HELPTEXT
source: Default: [aplusexercise:id]
fi: Oletus: [aplusexercise:id]

# LABEL_RESOURCE_LINK_TITLE
source: link text (resource link title)
fi: linkin teksti (resource link title)

# LTI_EXERCISE_RESOURCE_LINK_TITLE_HELPTEXT
source: Default: the menu label of the LTI service
fi: Oletus: LTI-palvelun nimi

# LABEL_APLUS_GET_AND_POST
source: Aplus GET and POST
fi: Aplus GET ja POST

# LTI_EXERCISE_APLUS_GET_AND_POST_HELPTEXT
source: Perform GET and POST from A+ to custom service URL with LTI data appended.
fi: A+ suorittaa ulkoisen palvelun GET ja POST pyynnöt lisätyillä LTI-tiedoilla.

# LABEL_OPEN_IN_IFRAME
source: open in iframe
fi: avaa iframe-kehyksessä

# LTI_EXERCISE_OPEN_IN_IFRAME_HELPTEXT
source: Open the assignment in an iframe inside the A+ page instead of a new window.
fi: Avaa tehtävä iframe-kehyksessä A+-sivun sisällä uuden ikkunan sijasta.

# MODEL_NAME_LTI_EXERCISE
source: LTI assignment
fi: LTI-tehtävä

# MODEL_NAME_LTI_EXERCISE_PLURAL
source: LTI assignments
fi: LTI-tehtävät

# LTI_EXERCISE_ERROR_SERVICE_URL_DOMAIN_MUST_MATCH_LTI_SERVICE
source: Domain of Service URL must match the domain of LTI Service or it should only be the path.
fi: Palveluosoitteen domainin täytyy vastata LTI-palvelun domainia tai osoitteen tulee olla vain polku.

# LTI_EXERCISE_ERROR_EXTERNAL_LTI_SERVICE_DISABLED
source: The assignment can not be loaded because the external LTI service has been disabled.
fi: Tehtävää ei voi ladata, koska ulkoinen LTI-palvelu on poistettu käytöstä.

# LABEL_LTI_CUSTOM_PARAMETERS
source: Custom parameters
fi: Mukautetut parametrit

# LTI_CUSTOM_PARAMETERS_HELPTEXT
source: Tool implementation specific additional options related to this exercise.
fi: Työkalun toteutuskohtaiset lisäoptiot tähän tehtävään liittyen.

# MODEL_NAME_LTI1P3_EXERCISE
source: LTI v1.3 assignment
fi: LTI v1.3 - tehtävä

# MODEL_NAME_LTI1P3_EXERCISE_PLURAL
source: LTI v1.3 assignments
fi: LTI v1.3 - tehtävät

# LABEL_EXERCISE_PAGE_CONTENT
source: assignment page content
fi: tehtäväsivun sisältö

# LABEL_SUBMISSION_PAGE_CONTENT
source: submissions page content
fi: palautussivun sisältö

# MODEL_NAME_STATIC_EXERCISE
source: static assignment
fi: staattinen tehtävä

# MODEL_NAME_STATICE_EXERCISE_PLURAL
source: static assignments
fi: staattiset tehtävät

# LABEL_FILES_TO_SUBMIT
source: files to submit
fi: palautettavat tiedostot

# EXERCISE_WITH_ATTACHMENT_FILES_TO_SUBMIT_HELPTEXT
source: File names that user should submit, use pipe character to separate files
fi: Tiedostonimet, jotka käyttäjän tulee palauttaa. Käytä |-merkkiä tiedostojen erottamiseen.

# LABEL_ATTACHMENT
source: attachment
fi: liitetiedosto

# MODEL_NAME_EXERCISE_WITH_ATTACHMENT
source: assignment with attachment
fi: tehtävä liitetiedostolla

# MODEL_NAME_EXERCISE_WITH_ATTACHMENT_PLURAL
source: assignments with attachments
fi: tehtävät liitetiedostoilla

source: Regrade
fi: Arvioi uudestaan

# LABEL_TASK_TYPE
source: Task type
fi: tehtävän tyyppi

# LABEL_TASK_ID
source: Task ID
fi: tehtävän tunniste

# MODEL_NAME_EXERCISE_TASK
source: Assignment background task
fi: Uudelleenarvioinnin tausta-ajo

# MODEL_NAME_EXERCISE_TASK_PLURAL
source: Assignment background tasks
fi: Uudelleenarvioinnin tausta-ajot

# LABEL_TARGET_CATEGORY
source: target category
fi: kohdekategoria

# MODEL_NAME_EXERCISE_COLLECTION
source: exercise collection
fi: tehtäväkokoelma

# MODEL_NAME_EXERCISE_COLLECTION_PLURAL
source: exercise collections
fi: tehtäväkokoelmat

# SUBMISSION_ERROR_POINTS_GREATER_THAN_MAX_POINTS
source: Points greater than maximum points are not allowed.
fi: Pisteet eivät voi ylittää enimmäispisteitä.

# SUBMISSION_ERROR_POINTS_LOWER_THAN_ZERO
source: Points lower than zero are not allowed.
fi: Pisteet eivät voi olla negatiivisia.

# LABEL_POINTS
source: Points
fi: Pisteet

# SUBMISSION_REVIEW_POINTS_OVERRIDE_HELPTEXT
source: Possible penalties are not applied - the points are set as given. This will <em>override</em> grader points!
fi: Mahdollisia myöhästymisvähennyksiä ei tehdä automaattisesti. Pisteet <em>korvaavat</em> automaattisen arvioinnin tuloksen!

# LABEL_MARK_AS_FINAL
source: Mark as final
fi: Merkitse lopulliseksi

# SUBMISSION_REVIEW_MARK_AS_FINAL_HELPTEXT
source: If selected, this will be the student's final grade for this assignment. Otherwise, the best submission determines the final grade.
fi: Jos valittu, tästä tulee tämän tehtävän lopullinen arvosana tälle opiskelijalle. Muussa tapauksessa parhaat pisteet saanut palautus määrittää lopullisen arvosanan.

# LABEL_STAFF_FEEDBACK
source: Staff feedback
fi: Kurssihenkilökunnan palaute

# SUBMISSION_REVIEW_ASSISTANT_FEEDBACK_HELPTEXT
source: HTML formatting is allowed. This will not override machine feedback.
fi: HTML-muotoilut sallitaan. Tämä ei korvaa automaattista palautetta.

source: Grader feedback
fi: Automaattinen palaute

# SUBMISSION_REVIEW_FEEDBACK_OVERRIDE_HELPTEXT
source: HTML formatting is allowed. This WILL override machine feedback.
fi: HTML-muotoilut sallitaan. Tämä KORVAA automaattisen palautteen.

# SUBMISSION_REVIEW_ERROR_POINTS_GREATER_THAN_MAX_POINTS -- {max:d}
source: The maximum points for this assignment are {max:d} and the given points are more than that.
fi: Annetut pisteet ylittävät tehtävän enimmäispisteet, {max:d}.

# LABEL_SUBMISSION_TIME
source: Submission time
fi: Palautusaika

# LABEL_STUDENTS
source: Students
fi: Opiskelijat

# LABEL_STUDENTS_BY_USER_ID
source: Students by user ID
fi: Opiskelijat käyttäjätunnuksen mukaan

# LABEL_STUDENTS_BY_STUDENT_ID
source: Students by student ID
fi: Opiskelijat opiskelijanumeron mukaan

# LABEL_STUDENTS_BY_EMAIL
source: Students by email
fi: Opiskelijat sähköpostiosoitteen mukaan

# SUBMISSION_CREATE_AND_REVIEW_ERROR_ALL_STUDENT_FIELDS_BLANK
source: One of the student fields must not be blank
fi: Ainakin yksi opiskelijakentistä tulee antaa

# SUBMISSION_CREATE_AND_REVIEW_ERROR_ONLY_ONE_STUDENT_FIELD_CAN_BE_GIVEN
source: Only one student field can be given
fi: Voidaan antaa vain yksi opiskelijakenttä

# LABEL_POINTS_GOAL_INPUT
source: Input personalized goal as a percentage or points (e.g., 50% or 150)
fi: Anna pistetavoite prosentteina tai pisteinä (esim. 50% tai 150)

# EXERCISE_VISIBILITY_PERMISSION_DENIED_MSG
source: Unfortunately, you are not permitted to view this assignment.
fi: Valitettavasti sinulla ei ole oikeutta nähdä tätä tehtävää.

# EXERCISE_VISIBILITY_ERROR_NOT_VISIBLE
source: The assignment is not currently visible.
fi: Tehtävä ei ole tällä hetkellä nähtävissä.

# EXERCISE_VISIBILITY_ERROR_NOT_OPEN_YET -- {}
source: The assignment opens for submissions at {}.
fi: Tämän tehtävän voi palauttaa {} alkaen.

# EXERCISE_VISIBLITY_ERROR_ONLY_RESISTERED_USERS
source: The assignment is only for registered users.
fi: Tämä tehtävä on vain rekisteröityneille opiskelijoille.

# EXERCISE_VISIBLITY_ERROR_ONLY_INTERNAL_USERS
source: The assignment is only for internal users.
fi: Tämä tehtävä on vain oppilaitoksen koulutusohjelmien opiskelijoille.

# EXERCISE_VISIBLITY_ERROR_ONLY_EXTERNAL_USERS
source: The assignment is only for external users.
fi: Tämä tehtävä on vain oppilaitoksen ulkopuolisille opiskelijoille.

# MODULE_MODEL_ANSWER_VISIBILITY_PERMISSION_DENIED_MSG
source: It contains model answers that have not been published yet.
fi: Se sisältää esimerkkiratkaisuja, joita ei ole vielä julkaistu.

# EXERCISE_ASSISTANT_PERMISSION_DENIED_MSG
source: Unfortunately, assistants are not permitted to view this.
fi: Valitettavasti assistenteilla ei ole oikeutta nähdä tätä.

# EXERCISE_ASSISTANT_PERMISSION_ERROR_NO_ASSISTANT_VIEWING
source: Assistant viewing is not allowed for this assignment.
fi: Assistentti ei voi nähdä tätä tehtävää.

# EXERCISE_ASSISTANT_PERMISSION_NO_ASSISTANT_GRADING
source: Assistant grading is not allowed for this assignment.
fi: Assistentti ei voi arvostella tätä tehtävää.

# SUBMISSION_VISIBILITY_PERMISSION_DENIED_MSG
source: Unfortunately, you are not permitted to view this submission.
fi: Valitettavasti sinulla ei ole oikeutta nähdä tätä palautusta.

# SUBMISSION_VISIBILITY_ERROR_ONLY_SUBMITTER
source: Only the submitter shall pass.
fi: Vain palautuksen tehneelle - only the submitter shall pass.

# EXERCISE_MODEL_ANSWER_VISIBILITY_PERMISSION_DENIED_MSG
source: Unfortunately, you are not permitted to view this model answer.
fi: Valitettavasti sinulla ei ole oikeutta nähdä tätä esimerkkiratkaisua.

# EXERCISE_MODEL_ANSWER_VISIBILITY_ERROR_NOT_ALLOWED_VIEWING
source: You are not allowed to view model answers for this assignment.
fi: Sinulla ei ole lupaa katsoa tämän tehtävän esimerkkiratkaisua.

# EXERCISE_SERVICE_ERROR_CONNECTION_FAILED
source: Connecting to the assignment service failed! Course staff has been notified.
fi: Tehtäväpalveluun ei saatu yhteyttä! Kurssihenkilökunnalle on ilmoitettu.

# ASSESSMENT_SERVICE_ERROR_CONNECTION_FAILED
source: Connecting to the assessment service failed! Course staff has been notified.
fi: Arviointipalveluun ei saatu yhteyttä! Kurssihenkilökunnalle on ilmoitettu.

source: The assessment service responded with invalid points. Points: {points:d}/{max:d} (assignment max {exercise_max:d})
fi: Tehtävän pisteytyksessä on vikaa. Pisteet: {points:d}/{max:d} (exercise max {exercise_max:d})

# ASSESSMENT_SERVICE_ERROR_RESPONDED_ERROR
source: The assessment service responded with an error.
fi: Arviointipalvelussa tapahtui virhe.

# TRIGGER_MANUAL
source: Manually
fi: Manuaalisesti

# TRIGGER_IMMEDIATE
source: Immediately
fi: Heti

# TRIGGER_TIME
source: At a specific time
fi: Tiettynä ajankohtana

# TRIGGER_DEADLINE
source: After deadline and personal extensions
fi: Määräajan ja henkilökohtaisten pidennyksien jälkeen

# TRIGGER_DEADLINE_ALL
source: After deadline and everyone's extensions
fi: Määräajan ja kaikkien opiskelijoiden pidennyksien jälkeen

# TRIGGER_COMPLETION
source: After completion (full points or all submissions used)
fi: Kun tehtävä on valmis (täydet pisteet tai kaikki palautukset käytetty)

# TRIGGER_DEADLINE_OR_FULL_POINTS
source: After deadline and personal extensions or full points
fi: Määräajan ja henkilökohtaisten pidennyksien jälkeen tai täysillä pisteillä

# LABEL_TRIGGER
source: When revealed
fi: Milloin paljastetaan

# LABEL_DELAY_MINUTES
source: Delay (minutes)
fi: Viive (minuuttia)

# LABEL_TIME
source: Time
fi: Aika

# LABEL_CURRENTLY_REVEALED
source: Currently revealed
fi: Paljastettu nyt

# LABEL_SHOW_ZERO_POINTS_IMMEDIATELY
source: Show feedback immediately if the submission gets 0 points
fi: Näytä palaute välittömästi jos tehtäväpalautus saa 0 pistettä

# MODEL_NAME_REVEAL_RULE
source: Reveal rule
fi: Paljastamissääntö

# MODEL_NAME_REVEAL_RULE_PLURAL
source: Reveal rules
fi: Paljastamissäännöt

# GRADING_MODE_TITLE -- {}
source: Grading mode: {}
fi: Arvostelutapa: {}

# ASSESS_SUBMISSION_REVIEW_SAVED_SUCCESS
source: The review was saved successfully and the submitters were notified.
fi: Palaute on tallennettu, ja opiskelijoille on lähetetty ilmoitus.

source: New regrade task created.
fi: Uudelleenarviointi aloitettu.

# REGRADE_ALREADY_RUNNING
source: Regrade task is already running.
fi: Uudelleenarviointi on jo käynnissä.

source: All submitters have been assessed.
fi: Kaikki palauttajat on arvosteltu.

source: Skipped
fi: Ohitettu

# ERROR_FAILED_TO_LOAD_RESOURCE
source: Failed to load the resource.
fi: Lataus epäonnistui.

# USER_NOT_ENROLLED
source: This person is not enrolled in the course.
fi: Tämä henkilö ei ole ilmoittautunut kurssille.

# NO_LONGER_PARTICIPATING_IN_COURSE -- {status}
source: This student is no longer participating in the course (status: {status}).
fi: Tämä opiskelija ei enää osallistu kurssille (tila: {status}).

# USER_IS_COURSE_STAFF
source: This person is a member of the course staff.
fi: Tämä henkilö kuuluu kurssin henkilökuntaan.

# ERROR_INVALID_POST_DATA -- {error}
source: Invalid POST data: {error}
fi: Epäkelvollinen POST sisältö: {error}

source: New submission stored.
fi: Uusi palautus on lisätty.

# SUBMISSION_APPROVAL_SUCCESS -- {points}, {max_points}
source: The submission was successfully approved. The new grade is {points}/{max_points}.
fi: Palautuksen hyväksyntä onnistui. Uudet pisteet ovat {points}/{max_points}.

# SUBMISSION_APPROVAL_ASSISTANT_PERMISSION_DENIED_MSG
source: Some of the targeted assignments do not allow assistants to grade them.
fi: Kaikki valitut tehtävät eivät salli assistentin arvostelevan niitä.

# SUBMISSION_APPROVAL_MULTIPLE_SUCCESS -- {count}
source: {count} late or unofficial submission was successfully approved.
fi: {count} myöhästynyt tai epävirallinen palautus hyväksyttiin.

# STATUS_INITIALIZED
source: Initialized
fi: Vastaanotettu

# STATUS_WAITING
source: In grading
fi: Arvosteltavana

# STATUS_ERROR
source: Error
fi: Virhe

# STATUS_REJECTED
source: Rejected
fi: Hylätty

# STATUS_UNOFFICIAL
source: No effect on grading
fi: Ei vaikuta arvosteluun

# DEADLINE_PASSED
source: Submitted after deadline
fi: Palautettu määräajan jälkeen

# LIMIT_EXCEEDED
source: Submission limit exceeded
fi: Palautuskertojen enimmäismäärä ylitetty

# LABEL_HASH
source: hash
fi: tunniste (hash)

# LABEL_GRADER
source: grader
fi: arvostelija

# LABEL_FEEDBACK
source: Feedback
fi: Palaute

# LABEL_UNOFFICIAL_SUBMISSION_TYPE
source: Unofficial submission type
fi: Epävirallisen palautuksen tyyppi

# LABEL_GRADING_TIME
source: grading time
fi: arvosteluaika

# LABEL_LATE_PENALTY_APPLIED
source: late penalty applied
fi: käytetty myöhästymissakko

# LABEL_FORCE_EXERCISE_POINTS
source: Force exercise points
fi: Pakota tehtävän pisteet

# LABEL_SERVICE_POINTS
source: service points
fi: palvelimen antamat pisteet

# LABEL_SERVICE_MAX_POINTS
source: service max points
fi: enimmäispisteet palvelimessa

# LABEL_SUBMISSION_DATA
source: submission data
fi: palautuksen tiedot
