Repository: apluslms/a-plus
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi

# LABEL_SEMESTER_OR_MONTH
source: Semester / month
fi: Lukukausi / kuukausi

# LABEL_SEMESTER_OR_MONTH_HELPTEXT
source: The semester when the course is running or the starting month.
fi: Lukukausi, jolloin kurssi on käynnissä tai aloituskuukausi.

# LABEL_AUTUMN
source: autumn
fi: syksy

# LABEL_SPRING
source: spring
fi: kevät

# LABEL_SUMMER
source: summer
fi: kesä

# LABEL_JANUARY
source: January
fi: tammikuu

# LABEL_FEBRUARY
source: February
fi: helmikuu

# LABEL_MARCH
source: March
fi: maaliskuu

# LABEL_APRIL
source: April
fi: huhtikuu

# LABEL_MAY
source: May
fi: toukokuu

# LABEL_JUNE
source: June
fi: kesäkuu

# LABEL_JULY
source: July
fi: heinäkuu

# LABEL_AUGUST
source: August
fi: elokuu

# LABEL_SEPTEMBER
source: September
fi: syyskuu

# LABEL_OCTOBER
source: October
fi: lokakuu

# LABEL_NOVEMBER
source: November
fi: marraskuu

# LABEL_DECEMBER
source: December
fi: joulukuu

# LABEL_TEST
source: test
fi: testi

# LABEL_UPDATE_AUTOMATICALLY
source: Update automatically
fi: Päivitä automaattisesti

# LABEL_UPDATE_AUTOMATICALLY_HELPTEXT
source: Update the course settings and materials automatically on Git push events. This affects the main platform and the grader. If this is disabled, the teacher would need to manually import the course from Git manager in the Edit course section after changing the structure of the course. The course will not be broken if the course build fails in Git manager, because in that case, the previous version is used.
fi: Päivitä kurssiasetukset ja -materiaalit automaattisesti Gittiin työnnettäessä. Tämä vaikuttaa pääalustaan ja graderiin. Jos tämä ei ole käytössä, opettajan on tuotava kurssi manuaalisesti Git Managerista Muokkaa kurssia -sivulla kurssin rakenteen muuttamisen jälkeen. Kurssi ei mene rikki, jos kurssin kääntäminen epäonnistuu, koska silloin käytetään edellistä versiota.

# LABEL_EMAIL_ON_ERROR
source: Email on error
fi: Lähetä sähköpostia virhetilanteessa

# LABEL_EMAIL_ON_ERROR_HELPTEXT
source: Email the course staff if the course build fails on Git push events.
fi: Lähetä kurssihenkilökunnalle sähköpostia, jos kurssin kääntäminen epäonnistuu Gittiin työnnettäessä.

# LABEL_GIT_ORIGIN_HELPTEXT
source: The git address of the repository for the course materials. This address is used in the 'git clone' command. Note: do not copy the address of the web page in GitLab. Copy the 'Clone with SSH' address, for example, git@version.aalto.fi:course/aplus-manual.git
fi: Kurssimateriaalien repositoryn git-osoite. Tätä osoitetta käytetään 'git clone' -komennossa. Huomautus: älä kopioi verkkosivun osoitetta GitLabissa. Kopioi 'Clone with SSH' -osoite, esimerkiksi git@version.aalto.fi:course/aplus-manual.git

# LABEL_GIT_BRANCH_HELPTEXT
source: The name of the git branch that you have created in the course git repository, for example, 'master' or '2022spring'.
fi: Kurssin git-repositoryyn luomasi git-haaran nimi, esimerkiksi 'master' tai '2022spring'.

# LABEL_SIS_INSTANCE
source: Course instance in Student Information System (SIS)
fi: Kurssikerta opintotietojärjestelmässä (Sisu)

# LABEL_SIS_INSTANCE_HELPTEXT
source: Course instance from which students are enrolled. The menu shows the start and ending times of the course instance, along with the enrolment type (e.g. course participation or exam enrolment).
fi: Kurssikerta, jonka kautta opiskelijat ilmoittautuvat. Valikossa näkyvät kurssikerran alkamis- ja päättymisajat sekä ilmoittautumistyyppi (esim. kurssille osallistuminen tai tenttiin ilmoittautuminen).

# LABEL_SIS_ENROLL_HELPTEXT
source: When enabled, students from local organization must enrol through SIS. This option only applies if you first select a course instance from the dropdown above.
fi: Kun valittu, paikallisten opiskelijoiden on ilmoittauduttava opintotietojärjestelmän kautta. Tätä valintaa sovelletaan vain, jos valitset ensin yllä olevasta valikosta kurssikerran.

# LABEL_SLUG
source: Slug
fi: Tunniste

# LABEL_COLOR
source: Colour
fi: Väri

# LABEL_KEY
source: Key
fi: Avain

# LABEL_KEY_HELPTEXT
source: The unique course key in Git manager. This key is part of the web addresses of the course in Git manager, for example, the addresses of the static files in the course git repository.
fi: Uniikki kurssiavain Git Managerissa. Tämä avain on osa kurssin verkko-osoitteita Git Managerissa, esimerkiksi kurssin git-repositoryssa olevien staattisten tiedostojen osoitteita.

# LABEL_UPDATE_HOOK_HELPTEXT
source: Unused, leave empty. (Send update notifications to this web address on Git push events.)
fi: Käyttämätön, jätä tyhjäksi. (Lähetä päivitysilmoitukset tähän verkko-osoitteeseen Gittiin työnnettäessä.)

# LABEL_ID_HELPTEXT
source: Course instance id in the database.
fi: Kurssikerran id tietokannassa.

# LABEL_APLUS_CONFIGURATION_JSON
source: Configuration JSON
fi: Kurssiasetusten JSON

# LABEL_APLUS_CONFIGURATION_JSON_HELPTEXT
source: The course materials are imported from this web address.
fi: Kurssimateriaalit tuodaan tästä verkko-osoitteesta.

# LABEL_HOOK_HELPTEXT
source: The webhook target for the course. You must copy this to the webhook settings of the course project in GitLab.
fi: Kurssin webhook-kohde. Sinun on kopioitava tämä kurssiprojektin webhook-asetuksiin GitLabissa.

# LABEL_WEBHOOK_SECRET_HELPTEXT
source: The secret token used in Git push notifications. You must copy this to the webhook settings of the course project in GitLab. The secret token prevents unauthorized access to triggering new course builds. Protect it like a password!
fi: Git push -ilmoituksissa käytetty salainen tunnus. Sinun on kopioitava tämä kurssiprojektin webhook-asetuksiin GitLabissa. Salainen tunnus estää luvattoman pääsyn käynnistämään kurssin kääntämisen. Suojaa sitä kuin salasanaa!

# ERROR_REQUIRED_WITH_SELECTED_TRIGGER
source: Required with the currently selected reveal option.
fi: Pakollinen tämän paljastamisvaihtoehdon ollessa valittuna.

source: Grading
fi: Arvostelu

source: Reveal submission feedback
fi: Tehtävien palautteen paljastaminen

# CATEGORY_lowercase
source: category
fi: kategoria

source: module
fi: moduuli

source: learning object
fi: oppimissisältö

# EXCEPTION_PARSING_SUBMISSION_JSON -- {error!s}
source: Parsing the submission JSON raised an error '{error!s}'.
fi: Palautus-JSONin jäsentäminen tuotti virheet '{error!s}'.

# JSON_FIELD_MISSING_OBJECTS
source: Missing JSON field: objects.
fi: Puuttuva JSON-kenttä: objects.

# JSON_INVALID_EXPECTED_LIST
source: Invalid JSON. Expected list or list in objects field
fi: Virheellinen JSON. Odotettiin listaa tai object kentässä listaa.

# JSON_ERROR_MISSING_FIELD_EXERCISE_ID -- {count:d}
source: Missing field "exercise_id" in object {count:d}.
fi: Puuttuva kenttä "exercise_id" oliossa {count:d}.

# JSON_ERROR_UNKNOWN_EXERCISE_ID -- {id:d}, {count:d}
source: Unknown exercise_id {id:d} in object {count:d}.
fi: Tuntematon exercise_id {id:d} oliossa {count:d}.

# JSON_ERROR_OBJECT_INVALID_FIELDS -- {ordinal:d}, {errors}
source: Object number {ordinal:d} has invalid fields: {errors}
fi: Arvostelulla numero {ordinal:d} on virheellisiä kenttiä: {errors}

# ERROR_PARSING_DATE -- {value}
source: Unable to parse value '{value}' as a date.
fi: Arvoa '{value}' ei voitu jäsentää päivämääränä.

# ERROR_PARSING_TIME_DURATION -- {value}
source: Unable to parse value '{value}' as a time duration.
fi: Arvoa '{value}' ei voitu jäsentää ajankestona.

# ERROR_PARSING_INT -- {value}
source: Unable to parse value '{value}' as an int.
fi: Arvoa '{value}' ei voitu jäsentää kokonaislukuna.

# ERROR_PARSING_FLOAT -- {value}
source: Unable to parse value '{value}' as a float.
fi: Arvoa '{value}' ei voitu jäsentää liukulukuna.

# ERROR_JSON_FIELD_UNKNOWN_VALUE -- {field}, {value}
source: Field '{field}' has an unknown value '{value}'.
fi: Kentällä '{field}' on tuntematon arvo '{value}'.

# REVEAL_RULE_ERROR_INVALID_JSON -- {key}
source: Invalid reveal rule definition '{key}'. Must be a JSON object with a 'trigger' field.
fi: Viallinen paljastamissäännön määrittely '{key}'. Täytyy olla JSON-objekti, jolla on 'trigger'-kenttä.

# ERROR_MODEL_SOLUTION_CHAPTER_NOT_FOUND -- {value}, {module}
source: Chapter '{value}' not found when setting the model answer for the course module '{module}'.
fi: Lukua '{value}' ei löytynyt kun yritettiin asettaa kurssimoduulin '{module}' esimerkkiratkaisulukua.

# BUILD_LOG_ERROR_URL_BLANK
source: Cannot request build log from build_log_url when it is blank.
fi: Käännöslokin hakeminen ei onnistu jos build_log_url on tyhjä.

# BUILD_LOG_ERROR_REQUESTING_FAILED -- {error!s}
source: Requesting build log failed with error '{error!s}'.
fi: Käännöslokin hakeminen epäonnistui virheellä '{error!s}'.

# BUILD_LOG_ERROR_PARSING_JSON -- {error!s}
source: Parsing the build log JSON raised error '{error!s}'.
fi: Käännöslokin jäsentäminen palautti virheen '{error!s}'.

# BUILD_LOG_ERROR_EMPTY_LOG
source: Remote URL returned an empty build log.
fi: Etäpalvelin palautti tyhjän käännöslokin.

# LEARNING_OBJECT_ERROR_REQUIRES_KEY
source: Learning object requires a key.
fi: Oppimissisältö vaatii avaimen.

# LEARNING_OBJECT_ERROR_REQUIRES_CATEGORY
source: Learning object requires a category.
fi: Oppimissisältö vaatii kategorian.

# LEARNING_OBJECT_ERROR_UNKNOWN_CATEGORY -- {category}
source: Unknown category '{category}'.
fi: Tuntematon kategoria '{category}'.

source: The site has no configuration for the LTI service '{lti_label}' used by the LTI assignment '{exercise_key}'. You may have misspelled the value for the field 'lti' or the site administrator has not yet added the configuration for the LTI service. The assignment was not created/updated due to the error.
fi: Sivustolla ei ole asetuksia LTI-palvelulle '{lti_label}', jota käyttää LTI-tehtävä '{exercise_key}'. Olet mahdollisesti kirjoittanut väärin kentän 'lti' arvon tai sivuston ylläpitäjä ei ole vielä lisännyt tämän LTI-palvelun asetuksia. Tehtävää ei luotu/päivitetty tämän virheen takia.

# COURSE_CONFIG_ERROR_CATEGORY_REQUIRES_NAME
source: Category requires a name.
fi: Kategoria vaatii nimen.

# COURSE_CONFIG_ERROR_MODULE_REQUIRES_KEY
source: Module requires a key.
fi: Moduuli vaatii avaimen.

# COURSE_CONFIG_ERROR_CATEGORIES_REQUIRED_OBJECT
source: Categories required as an object.
fi: Kategoriat vaaditaan oliona.

# COURSE_CONFIG_ERROR_MODULES_REQUIRED_ARRAY
source: Modules required as an array.
fi: Moduulit vaaditaan taulukkona.

# COURSE_CONFIG_ERROR_ASSISTANTS_AS_SID_ARRAY
source: Assistants must be given as a student ID array.
fi: Assistentit tulee antaa opiskelijanumero-taulukkona.

# COURSE_CONFIG_ERROR_ASSISTANT_NO_USER_WITH_SID -- {id}
source: Adding the assistant failed, because an associated user with student ID {id} does not exist.
fi: Assistentin lisääminen epäonnistui, sillä käyttäjää opiskelijanumerolla {id} ei ole olemassa.

# PUBLISH_RESPONSE_NON_200 -- {status_code}
source: Publishing responded with status {status_code}
fi: Julkaiseminen palautti statuksen {status_code}

# PUBLISH_ERROR_JSON_PARSER_FAILED -- {e}, {text}
source: Failed to load publishing response JSON: {e}: {text}
fi: Julkaisun vastaus-JSONin lataus epäonnistui: {e}: {text}

# PUBLISHED_WITH_ERRORS -- {publish_url}
source: Publishing changes ({publish_url}) failed:
fi: Asetusten muuttaminen ({publish_url}) epäonnistui:

# COURSE_CONFIG_URL_REQUIRED
source: Configuration URL required.
fi: Sisältöasetusten URL vaaditaan.

# COURSE_CONFIG_ERROR_REQUEST_FAILED -- {error!s}
source: Request for a course configuration failed with error '{error!s}'. Configuration of course aborted.
fi: Kurssin sisältöasetusten päivityspyyntö epäonnistui virheellä '{error!s}'. Asetusten päivitys keskeytettiin.

# COURSE_CONFIG_ERROR_JSON_PARSER_FAILED -- {error!s}
source: JSON parser raised error '{error!s}'. Configuration of course aborted.
fi: JSON-jäsentäjä tuotti virheen '{error!s}'. Asetusten päivitys keskeytettiin.

# COURSE_CONFIG_ERROR_INVALID_JSON
source: Invalid configuration JSON received from the service (JSON must define an object).
fi: Palvelu palautti epäkelvon JSON-datan (JSONin täytyy määritellä avain-arvo-pareja).

# COURSE_CONFIG_ERROR_SERVICE_FAILED_TO_EXPORT
source: The service failed to export course configurations. The configurations may be invalid (for example, check the syntax of YAML files).
fi: Palvelu epäonnistui viemään kurssin asetukset. Asetukset saattavat olla epäkelpoja (esim. tarkista kurssin YAML-tiedostojen syntaksi).

source: Batch assess submissions
fi: Joukkoarvostele palautuksia

source: Batch create and assess submissions
fi: Luo ja arvostele palautusjoukkoja

# BATCH_CREATE_AND_ASSESS_JSON_FORM_INSTRUCTIONS -- %(id)s, %(exercises_api_url)s
source: <p><em>Use only if you know what you are doing!</em></p> <p>By submitting json to the form below you can try to create and assess multiple assignments for students automatically.</p> <dl> <dt>XXXXX1 and XXXXX2</dt> <dd>the real student ids</dd> <dt>X1 (integer)</dt> <dd>the system user ID of the desired grader. Your user ID is <b>%(id)s.</b></dd> <dt>Z1 and Z2 (integers)</dt> <dd>the system assignment IDs. You can find the assignment IDs from the <a href='%(exercises_api_url)s'>course exercises API</a>. Alternatively, take a look at the web address of the <b>Edit assignment</b> button under <b>Edit course &#8594; Content</b>. The <b>Edit assignment</b> address includes a number after the course keys.</dd> </dl>
fi: <p><em>Käytä vain jos tiedät, mitä olet tekemässä!</em></p> <p>Lähettämällä tämän voit yrittää luoda ja arvostella useita tehtäviä automaattisesti.</p> <dl> <dt>XXXXX1 ja XXXXX2</dt> <dd>oikeat opiskelijanumerot</dd> <dt>X1 (kokonaisluku)</dt> <dd>Toivotun arvostelijan userprofile id. Sinun userprofile id on <b>%(id)s</b>.</dd> <dt>Z1 ja Z2 (kokonaislukuja)</dt> <dd>tehtävien ID:t. Löydät tehtävien ID:t <a href='%(exercises_api_url)s'>kurssitehtävien API:sta</a>. Vaihtoehtoisesti tarkista tehtävän ID <b>Muokkaa tehtävää</b> -napin verkko-osoitteesta, joka löytyy osiosta <b>Muokkaa kurssia &#8594; Sisältö</b>. <b>Muokkaa tehtävää</b> -sivun verkko-osoite sisältää numeron kurssiavainten jälkeen.</dd> </dl>

source: Build initiated by
fi: Käännoksen aloitti

source: Build initiated at
fi: Käännös aloitettiin

source: Build finished
fi: Käännös valmistui

# BUILD_NOT_YET_BUILT
source: Not yet built
fi: Käännös kesken

source: Instances
fi: Kurssikerrat

# HIDDEN_lowercase
source: hidden
fi: piilotettu

# CLONE_COURSE
source: Create new course instance
fi: Luo uusi kurssikerta

# CLONE_COURSE_AND_DATA_INTO_NEW_INSTANCE_DESCRIPTION
source: This action creates a new course instance and copies the selected data into it.
fi: Tämä toiminto luo uuden kurssikerran ja kopioi valitut tiedot siihen.

# CLONE_INTO_NEW_INSTANCE
source: Create new instance
fi: Luo uusi kurssikerta

# CLONING_COURSE
source: Creating course instance...
fi: Luodaan kurssikertaa...

# IMPORT_CONTENT_CONFIG_URL
source: Import content configuration from URL
fi: Tuo sisältöasetukset URL-osoitteesta

# APPLY_CHANGES_TOOLTIP
source: Compares new configuration to the previous configuration, and applies only the changes.
fi: Vertaa uusia sisältöasetuksia aikaisempiin, ja päivittää vain muuttuneet osat.

source: Apply changes
fi: Tuo muutokset

# OVERRIDE_COURSE_CONFIGURATION_TOOLTIP
source: Reapplies the full configuration. Slower than just applying changes. May fix issues with a part of the configuration not updating.
fi: Päivittää kaikki sisältöasetukset. Hitaampi kuin pelkkien muutosten päivittäminen. Saattaa korjata ongelman, jossa jotkin sisältöasetukset eivät päivity.

# CLEAR_CONTENT_CACHE_TOOLTIP
source: Clears cached course content. May fix issues with content not updating on course pages.
fi: Poistaa kurssisisällön välimuistista. Saattaa korjata ongelman, jossa sisältö ei päivity kurssisivuilla.

source: Clear content cache
fi: Tyhjennä tehtävien välimuisti

source: Retrieve latest build log
fi: Hae uusin käännösloki

# PREV_MODIFICATION_OF_COURSE_INSTANCE_TIME
source: This course was previously built or the course settings were modified on
fi: Tämä kurssi on viimeksi käännetty tai kurssin asetuksia on muokattu

# EXERCISE_CATEGORIES
source: Assignment categories
fi: Tehtäväkategoriat

source: Edit category
fi: Muokkaa kategoriaa

source: Add new category
fi: Lisää uusi kategoria

source: Course modules
fi: Kurssimoduulit

source: Edit module
fi: Muokkaa moduulia

source: View module
fi: Katsele moduulia

# EDIT_EXERCISE
source: Edit assignment
fi: Muokkaa tehtävää

source: Edit chapter
fi: Muokkaa lukua

# VIEW_EXERCISE
source: View assignment
fi: Katsele tehtävää

source: View chapter
fi: Katsele lukua

source: View submissions
fi: Katsele palautuksia

source: Add new learning object
fi: Lisää uusi oppimissisältö

# CHOOSE_LEARNING_OBJECT_TYPE
source: Choose learning object type to add
fi: Valitse lisättävän oppimissisällön tyyppi

source: Chapter
fi: Luku

# REMOTE_CHAPTER_DESCRIPTION
source: A remote content page loaded in as a chapter.
fi: Ulkoinen sisältösivu, joka ladataan luvuksi

# REMOTE_EXERCISE_PAGE_DESCRIPTION
source: A remote assignment page loaded in for posting submissions.
fi: Ulkoinen tehtäväsivu, johon palautukset lähetetään

# LTI_EXERCISE
source: LTI Assignment
fi: LTI-tehtävä

# REMOTE_LTI_EXERCISE_PAGE_DESCRIPTION
source: A remote assignment page loaded in for posting submissions including signed LTI course and student information.
fi: Ulkoinen tehtäväsivu, jossa käytetään LTI-muotoisia kurssi- ja opiskelijatietoja

# EXERCISE_WITH_ATTACHMENT
source: Assignment with attachment
fi: Tehtävä liitetiedostolla

# LOCAL_EXERCISE_WITH_ATTACHMENT_PAGE_DESCRIPTION
source: A local page accepting files and initiating remote grading with teacher provided grading attachment.
fi: Paikallinen tehtäväsivu tiedostojen vastaanottamiseen ja ulkoinen automaattiarviointi opettajan asettaman liitetiedoston kanssa

# STATIC_EXERCISE
source: Static assignment
fi: Staattinen tehtävä

# LOCAL_STATIC_EXERCISE_PAGE_DESCRIPTION
source: A local page with editable markup content.
fi: Paikallinen sivu muokattavalla HTML-sisällöllä

source: Add new module
fi: Lisää uusi moduuli

source: Renumerate learning objects for each module
fi: Numeroi oppimissisällöt uudelleen moduuleittain

source: Renumerate learning objects ignoring modules
fi: Numeroi oppimissisällöt uudelleen huomioimatta moduuleita

# INDEX
source: Front page
fi: Etusivu

source: Menu
fi: Valikko

source: Submission tags
fi: Palautusmerkinnät

source: Batch assess
fi: Joukkoarviointi

# EDIT_GITMANAGER
source: Edit Git manager settings
fi: Muokkaa Git managerin asetuksia

source: Open in Git manager
fi: Avaa Git managerissa

# EDIT_GITMANAGER_DESCRIPTION
source: This action will update the course instance settings on Git manager.
fi: Tämä toiminto päivittää kurssikerran asetuksia Git managerissa.

source: Updating Git manager...
fi: Päivitetään Git manageria...

# EDIT_COURSE_INDEX
source: Edit course front page
fi: Muokkaa kurssin etusivua

source: Details
fi: Tiedot

source: Edit course details
fi: Muokkaa kurssin tietoja

# EDIT_MODEL -- %(model)s, %(id)s
source: Edit %(model)s ID %(id)s
fi: Muokkaa %(model)s ID %(id)s

# ADD_NEW_MODEL -- %(model)s
source: Add new %(model)s
fi: Lisää uusi %(model)s

# EDIT_MODEL -- %(model)s
source: Edit %(model)s
fi: Muokkaa %(model)s

source: Remote service
fi: Ulkoinen palvelu

# FILL_IN_URL_AND
source: Fill in the URL and
fi: Syötä URL-osoite ja

source: Download possible metadata
fi: Lataa mahdollinen metadata

# REMOVE_MODEL -- %(model)s, %(id)s
source: Remove %(model)s ID %(id)s
fi: Poista %(model)s ID %(id)s

# REMOVE_MODEL -- %(model)s
source: Remove %(model)s
fi: Poista %(model)s

# REMOVE_MODEL_CONFIRM -- %(model)s
source: Confirm %(model)s removal
fi: Vahvista %(model)s poisto

# REMOVE_MODEL_CONFIRMATION_ALERT -- %(model)s, %(name)s
source: You are removing %(model)s <strong>%(name)s</strong>. Are you sure?
fi: Olet poistamassa %(model)s <strong>%(name)s</strong>. Oletko varma?

# REMOVE_EXERCISE_MODEL_CONFIRMATION_ALERT -- %(num)s
source: If you remove this assignment, <strong>all the %(num)s submissions to the assignment will also be removed</strong>.
fi: Jos poistat tämän tehtävän, <strong>kaikki tehtävän %(num)s palautusta poistetaan myös</strong>.

# REMOVE_MODEL_MUST_BE_EMPTY -- %(model)s, %(name)s
source: The %(model)s <strong>%(name)s</strong> is not empty. Contained assignments must be removed first.
fi: Tämä %(model)s <strong>%(name)s</strong> ei ole tyhjä. Sen sisältämät tehtävät pitää poistaa ensin.

source: Add new submission tag
fi: Lisää palautusmerkintä

source: Remove submission tag
fi: Poista palautusmerkintä

# REMOVE_SUBMISSION_TAG_CONFIRMATION
source: Remove submission tag
fi: Poista palautusmerkintä

# REMOVE_SUBMISSION_TAG_CONFIRMATION_ALERT
source: Are you sure you want to remove the following submission tag?
fi: Haluatko varmasti poistaa tämän palautusmerkinnän?

source: Edit submission tag
fi: Muokkaa palautusmerkintää

source: Tag
fi: Merkintä

source: Slug
fi: Tunniste

source: Description
fi: Kuvaus

source: Actions
fi: Toiminnot

source: No submission tags
fi: Ei palautusmerkintöjä

source: Add new user tag
fi: Lisää käyttäjämerkintä

source: Remove user tag
fi: Poista käyttäjämerkintä

# REMOVE_USER_TAG_CONFIRMATION
source: Confirm user tag removal
fi: Vahvista käyttäjämerkinnän poisto

# REMOVE_USER_TAG_CONFIRMATION_ALERT
source: Are you sure you want to remove following user tag?
fi: Haluatko varmasti poistaa seuraavan käyttäjämerkinnän?

source: Edit student tag
fi: Muokkaa opiskelijamerkintää

source: Add new student tag
fi: Lisää uusi opiskelijamerkintä

source: Student tags
fi: Opiskelijamerkinnät

source: Visible to students
fi: Näkyy opiskelijoille

source: Tag students
fi: Merkitse opiskelijoita

source: No student tags.
fi: Ei opiskelijamerkintöjä.

source: Add new user tagging
fi: Merkitse opiskelijoita

# ERROR_EXERCISE_CATEGORY_MUST_EXIST_BEFORE_CREATEING_EXERCISES
source: At least one assignment category must be created before creating assignments.
fi: Vähintään yksi tehtäväkategoria pitää luoda ennen tehtävien lisäämistä.

# FAILURE_SAVING_MODEL_DUE_TO_ERROR -- {name}, {error}
source: Failed to save {name} due to an error '{error}'.
fi: Kohteen {name} tallennus epäonnistui virheen '{error}' takia.

# SUCCESS_SAVING_MODEL -- {name}
source: The {name} was saved successfully.
fi: {name} tallennettiin onnistuneesti.

# FAILURE_SAVING_MODEL -- {name}
source: Failed to save {name}.
fi: Kohteen {name} tallennus epäonnistui.

# TAGGED_USER_WITH_TAG -- {user_name}, {tag_name}
source: Tagged user {user_name} with tag {tag_name}.
fi: Lisättiin käyttäjälle {user_name} merkintä {tag_name}

source: New submissions stored.
fi: Uudet palautukset tallennettiin.

# COURSE_INSTANCE_CLONED
source: Course instance is now cloned.
fi: Kurssikerta on nyt kopioitu.

source: Git manager error:
fi: Git manager virhe:

# COURSE_INSTANCE_BUILD_DURATION_INFO
source: The course will appear empty until the build is complete. This can take several minutes. Check the build log at <b>Edit course &#8594; Content &#8594; Retrieve latest build log</b>.
fi: Kurssi on tyhjä, kunnes kääntäminen on suoritettu. Tämä voi kestää useita minuutteja. Tarkista käännösloki kohdasta <b>Muokkaa kurssia &#8594; Sisältö &#8594; Hae uusin käännösloki</b>.

# COURSE_INSTANCE_WEBHOOK_INFO
source: Remember to copy the Webhook secret and hook URL to the webhook settings of the course project in GitLab. You can find the Webhook secret and hook URL in the section <b>Edit course &#8594; Git manager</b>.
fi: Muista kopioida Webhook secret ja hook URL kurssiprojektin webhook-asetuksiin GitLabissa. Löydät Webhook secretin ja hook URL:n osiosta <b>Muokkaa kurssia &#8594; Git manager</b>.

# GITMANAGER_UPDATED
source: Git manager is now updated.
fi: Git manager on nyt päivitetty.

# CONFIGURED_WITH_WARNINGS
source: Configuring was successful with warnings:
fi: Asetusten muuttaminen onnistui varoituksilla:
