Repository: apluslms/a-plus
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi

# LABEL_GRADING_DATA
source: grading data
fi: arvostelun tiedot

# LABEL_META_DATA
source: metadata
fi: metatiedot

# MODEL_NAME_SUBMISSION
source: submission
fi: palautus

# MODEL_NAME_SUBMISSION_PLURAL
source: submissions
fi: palautukset

# LABEL_SUBMISSION_TAG
source: Submission tag
fi: Palautusmerkintä

# LABEL_ACTIVE
source: active
fi: aktiivinen

# MODEL_NAME_SUBMISSION_DRAFT
source: submission draft
fi: palautusluonnos

# MODEL_NAME_SUBMISSION_DRAFT_PLURAL
source: submission drafts
fi: palautusluonnokset

# LABEL_PARAM_NAME
source: parameter name
fi: parametrin nimi

# LABEL_FILE_OBJECT
source: file
fi: tiedosto

# MODEL_NAME_SUBMITTED_FILE
source: submitted file
fi: palautettu tiedosto

# MODEL_NAME_SUBMITTED_FILE_PLURAL
source: submitted files
fi: palautetut tiedostot

# LABEL_NUMBER_OF_RETRIES
source: Number of retries
fi: Uudelleenyritysten määrä

# MODEL_NAME_PENDING_SUBMISSION
source: Pending submission
fi: Keskeneräinen palautus

# MODEL_NAME_PENDING_SUBMISSION_PLURAL
source: Pending submissions
fi: Keskeneräiset palautukset

source: Total points
fi: Yhteispisteet

# DUPLICATE_SUBMISSION_TITLE
source: Identical submission
fi: Identtinen palautus

# DUPLICATE_SUBMISSION
source: This submission is identical to the previous submission <span data-dup-submission></span>. Are you sure you want to submit it?
fi: Tämä palautus on identtinen aikaisemman palautuksen <span data-dup-submission></span> kanssa. Oletko varma, että haluat lähettää palautuksen?

# COURSE_ENROLLMENT_SUCCESSFUL
source: You have successfully enrolled in the course!
fi: Kurssille ilmoittautuminen onnistui!

source: Course front page
fi: Kurssin etusivu

source: Current status
fi: Tila tällä hetkellä

source: Earned points
fi: Ansaitut pisteet

source: Late
fi: Myöhässä

source: Exercise info
fi: Tehtävän tiedot

# EXERCISE_CATEGORY
source: Assignment category
fi: Tehtäväkategoria

source: Your submissions
fi: Palautuksesi

source: Points required to pass
fi: Pistevaatimus

source: Personal extended deadline
fi: Henkilökohtainen pidennetty määräaika

source: Late submission deadline
fi: Myöhästyneiden palautuksien määräaika

source: Group size
fi: Ryhmäkoko

source: Total number of submitters
fi: Palauttaneita opiskelijoita yhteensä

# EXERCISE_ERROR_COMMUNICATION
source: An error occurred while sending the submission for grading. Make sure you're connected to the internet. If a submission was consumed, the submission will be automatically graded after the service is available again.
fi: Palautuksen lähettämisessä arvosteluun tapahtui virhe. Tarkistathan internet-yhteytesi. Jos palautuskerta käytettiin, palautus arvostellaan automaattisesti, kun palvelu on jälleen käytettävissä.

# EXERCISE_ERROR_GRADING_TIMEOUT
source: Unfortunately, grading takes longer than expected. Return later to see the result.
fi: Valitettavasti arvostelu kestää odotettua kauemmin. Palaa myöhemmin katsomaan palautetta.

source: Grading submission...
fi: Palautusta arvostellaan...

source: Current points
fi: Nykyiset pisteet

source: Points on this course
fi: Pisteet tällä kurssilla

# VIEW_FILE -- %(filename)s
source: View the file %(filename)s
fi: Katsele tiedostoa %(filename)s

source: Download
fi: Lataa

# DOWNLOAD_FILE -- %(filename)s
source: Download the file %(filename)s
fi: Lataa tiedosto %(filename)s

source: File not found
fi: Tiedostoa ei löytynyt

# EXERCISE_NO_MODEL_ANSWER
source: No model answer has been supplied for this assignment.
fi: Tälle tehtävälle ei ole annettu malliratkaisua.

# UNOFFICIAL_DESCRIPTION
source: Submitted after deadline or exceeded submission limit
fi: Palautettu määräajan jälkeen tai palautuskertojen enimmäismäärä ylitetty

source: Accepted
fi: Hyväksytty

source: Rejected
fi: Hylätty

source: Submitted
fi: Palautettu

# CONFIRMABLE_POINTS_DESCRIPTION
source: You must submit here to confirm your points. Submissions are accepted even after the deadline.
fi: Tämä palautus vaaditaan pisteiden vahvistamiseksi. Palautuksia vastaanotetaan vielä määräajan jälkeenkin.

source: Missing
fi: Puuttuu

source: Not submitted
fi: Ei palautuksia

source: Results of some assignments are currently hidden.
fi: Joidenkin tehtävien tulokset on tällä hetkellä piilotettu.

source: Points
fi: Pisteet

source: Points to pass
fi: Vaaditut pisteet

# PERSONALIZED_POINTS_GOAL
source: Points goal
fi: Pistetavoite

source: Submission info
fi: Palautuksen tiedot

source: Submitted on
fi: Palautushetki

source: Includes late penalty
fi: Sisältää myöhästymissakon

# PSEUDONYMIZED_SUBMITTERS
source: Anonymous submitters
fi: Anonymisoidut palauttajat

source: Posting submission...
fi: Palautusta lähetetään...

# EXERCISE_HAS_NO_TEMPLATE
source: This assignment has no template.
fi: Tällä tehtävällä ei ole pohjatiedostoa.

# SUBMITTER_COUNT -- %(number)s, %(percentage)s
source: Submitters: %(number)s <small class='text-body-secondary'>%(percentage)s%%</small>
fi: Palauttajia: %(number)s <small class="text-body-secondary">%(percentage)s%%</small>

# USER_LAST_VISITED -- %(name)s, %(link)s
source: You have last visited <a href="%(link)s">%(name)s</a>
fi: Olet ollut oppimateriaalissa viimeksi kohdassa <a href="%(link)s">%(name)s</a>

# PLACES_TO_START -- %(name)s, %(link)s, %(toc_link)s
source: You can start from <a href="%(link)s">%(name)s</a> or browse the <a href="%(toc_link)s">course materials</a>.
fi: Voit aloittaa täältä <a href="%(link)s">%(name)s</a> tai selata <a href="%(toc_link)s">kurssimateriaalia</a>.

# FILTER_VIEW
source: Show
fi: Näytä

source: Expand all modules
fi: Laajenna kaikki moduulit

# AUTO_SCROLL
source: Automatic scrolling
fi: Automaattinen vieritys

# AUTO_SCROLL_BEHAVIOR_INSTANT
source: Instant scrolling
fi: Nopea vieritys

# HIDDEN_capitalized
source: Hidden
fi: Piilotettu

source: Requires
fi: Vaaditaan

# ASSIGNMENTS_WITH_PERSONAL_DEADLINE_DEVIATION
source: Assignments with personal deadline extensions
fi: Tehtäviä henkilökohtaisella määräaikapidennyksellä

source: Opens on
fi: Avautuu

source: Exercises open on
fi: Tehtävät avautuvat

source: Open for reading
fi: Lukumateriaali avoinna

# POINTS_REQUIRED_TO_PASS_MODULE -- %(points)s
source: %(points)s points required to pass the module.
fi: Moduulin suorittamiseen vaaditaan %(points)s pistettä.

# POINTS_GOAL_TOOLTIP
source: Set a personal points goal for this module. This goal is only visible to you. Once the goal has been reached, the points progress bar changes colour to blue.
fi: Aseta henkilökohtainen pistetavoite tälle moduulille. Tavoite näkyy vain sinulle. Kun tavoite on saavutettu, pistepalkki vaihtaa värin siniseksi.

source: Points goal
fi: Pistetavoite

# CHANGES_ARE_POSSIBLE_IN_EXERCISES_BEFORE_MODULE_OPENING
source: There may be changes in the assignments before the module opens!
fi: Tehtäviin saattaa tulla muutoksia ennen kierroksen avautumista!

source: Submissions
fi: Palautukset

source: No submissions yet
fi: Ei vielä palautuksia

# MODULE_MODEL_ANSWER_NOT_VISIBLE
source: This chapter is hidden, since it contains model answers that have not been published yet.
fi: Tämä luku on piilotettu, sillä se sisältää esimerkkiratkaisuja, joita ei ole vielä julkaistu.

source: Opens
fi: Avautuu

# CANNOT_SUMBIT_EXERCISE_WARNING
source: You cannot submit this assignment
fi: Et voi palauttaa tätä tehtävää

source: Show anyway
fi: Näytä kuitenkin

# ENROLLMENT_INFORMATION
source: Enrolment information
fi: Ilmoittautumisen tiedot

# LOADING_EXERCISE
source: Loading assignment...
fi: Tehtävää ladataan...

# EXERCISE_DESCRIPTION
source: Assignment description
fi: Tehtävänanto

source: My submissions
fi: Palautukseni

source: Model answer
fi: Esimerkkiratkaisu

source: Exercise template
fi: Pohjatiedosto

source: Inspect submission
fi: Tutki palautusta

source: View all submissions
fi: Näytä kaikki palautukset

# OPEN_EXERCISE_IN_NEW_TAB
source: Open this assignment in a new tab (recommended for keyboard and assistive technology users)
fi: Avaa tämä tehtävä uudessa välilehdessä (suositellaan näppäimistön ja avustavan teknologian käyttäjille)

source: Show model answer
fi: Näytä esimerkkiratkaisu

# SHOW_EXERCISE_TEMPLATE
source: Show assignment template
fi: Näytä pohjatiedosto

# POINTS_REQUIRED_TO_PASS -- %(points)s
source: %(points)s points required to pass
fi: Läpäisyyn vaaditaan %(points)s pistettä

# PENALTY_AFTER -- %(penalty)s, %(deadline)s
source: -%(penalty)s%% penalty after %(deadline)s
fi: -%(penalty)s%% pistevähennys alkaen %(deadline)s

source: To be submitted alone
fi: Palautetaan yksin

# TO_BE_SUBMITTED_ALONE_OR_GROUPS -- %(size)s
source: To be submitted alone or in groups of %(size)s
fi: Palautetaan yksin tai %(size)s hengen ryhmissä

# TO_BE_SUBMITTED_ALONE_OR_GROUPS -- %(min)s, %(max)s
source: To be submitted alone or in groups of %(min)s-%(max)s
fi: Palautetaan yksin tai %(min)s-%(max)s hengen ryhmissä

# TO_BE_SUBMITTED_GROUPS -- %(size)s
source: To be submitted in groups of %(size)s
fi: Palautetaan %(size)s hengen ryhmissä

# TO_BE_SUBMITTED_GROUPS -- %(min)s, %(max)s
source: To be submitted in groups of %(min)s-%(max)s
fi: Palautetaan %(min)s-%(max)s hengen ryhmissä

# SUBMISSION_ACCEPTED_FOR_GRADING
source: Your submission has been received.
fi: Palautuksesi on vastaanotettu arvostelua varten.

# PERSONALIZED_POINTS_MODAL_SUCCESS
source: Succesfully set personalized points goal
fi: Pistetavoite asetettu onnistuneesti

# PERSONALIZED_POINTS_MODAL_FAILURE
source: Failed to set personalized points goal
fi: Pistetavoitteen asettaminen epäonnistui

# PERSONALIZED_POINTS_MODAL_NOT_NUMBER
source: Input needs to be a percentage or a number (e.g., 50% or 150)
fi: Pistetavoite tulee antaa joko prosentteina tai pisteinä (esim. 50% or 150)

# PERSONALIZED_POINTS_MODAL_LESS_THAN_REQUIRED
source: You cannot set the personalized points goal to be less than the points required to pass the module
fi: Pistetavoite ei voi olla vähemmän kuin moduulin läpäisyyn vaaditut pisteet

# PERSONALIZED_POINTS_MODAL_REMOVE_SUCCESS
source: Succesfully removed personalized points goal
fi: Pistetavoite poistettu onnistuneesti

# PERSONALIZED_POINTS_MODAL_REMOVE_FAILURE
source: Failed to remove personalized points goal
fi: Pistetavoitteen poistaminen epäonnistui

# PERSONALIZED_POINTS_MODAL_TITLE
source: Set personalized points goal for module
fi: Aseta pistetavoite moduulille

source: Results
fi: Tulokset

source: Assessed by %(user)s, %(time)s
fi: Arvostellut %(user)s, %(time)s

source: Assessed by
fi: Arvostellut

source: Somebody
fi: Joku

source: Not assessed manually
fi: Ei arvosteltu manuaalisesti

source: Add tagging
fi: Lisää merkintä

source: Approve submission
fi: Hyväksy pisteytetyksi

source: Submission details
fi: Palautuksen lisätiedot

# COMPARE_TO_MODEL
source: Compare to model answer
fi: Vertaa mallivastaukseen

source: Regrade automatically
fi: Lähetä uudelleenarviointiin

source: Help
fi: Ohjeet

source: Assess manually
fi: Arvioi tämä

source: Loading...
fi: Ladataan...

source: Grader errors
fi: Virheet tarkistimelta

# ASSISTANT_FEEDBACK
source: Staff feedback
fi: Kurssihenkilökunnan palaute

# SUBMISSION_APPROVAL_TITLE
source: Approve Late and Unofficial Submissions
fi: Hyväksy myöhästyneet ja epäviralliset palautukset pisteytetyiksi

# SUBMISSION_APPROVAL_DESCRIPTION
source: You may approve late and/or unofficial submissions. Normally, late submissions suffer a points penalty and unofficial submissions do not affect the grading at all. Approving removes the late penalty of a given submission and changes it to a normal, graded submission (with the status "ready"). The change is irreversible.
fi: Voit hyväksyä myöhästyneet ja/tai epäviralliset palautukset pisteytetyiksi. Tavallisesti myöhästyneet palautukset menettävät pisteitä sakon takia ja epäviralliset palautukset eivät vaikuta ollenkaan arviointiin. Hyväksyminen poistaa myöhästymissakon ja muuttaa palautukset tavalliseksi, pisteytetyksi palautukseksi (tilassa "valmis"). Hyväksyntää ei voi peruuttaa.

# SUBMISSION_APPROVAL_CONFIRMATION_TEXT
source: Approve late and/or unofficial submission(s) for the student:
fi: Hyväksy seuraavan opiskelijan myöhästyneitä ja/tai epävirallisia palautuksia pisteytetyiksi:

# SUBMISSION_APPROVAL_APPROVE_MULTIPLE_BUTTON
source: Toggle approving a single or multiple submissions
fi: Vaihda yhden tai usean palautuksen hyväksynnän välillä

# SUBMISSION_APPROVAL_APPROVE_MULTIPLE_SELECT_SCOPE
source: Select the scope of submission approval.
fi: Valitse hyväksyttävien palautusten laajuus.

# SUBMISSION_APPROVAL_APPROVE_MULTIPLE_SCOPE_EXERCISE -- %(exercise)s
source: Approve all submissions in this assignment only: %(exercise)s
fi: Hyväksy kaikki palautukset tässä tehtävässä: %(exercise)s

# SUBMISSION_APPROVAL_APPROVE_MULTIPLE_SCOPE_MODULE -- %(module)s
source: Approve all submissions in all assignments in this module: %(module)s
fi: Hyväksy kaikki palautukset kaikissa tehtävissä tässä moduulissa: %(module)s

# SUBMISSION_APPROVAL_APPROVE_MULTIPLE_SELECT_TYPE
source: Select the type of submissions to be approved.
fi: Valitse hyväksyttävien palautusten tyyppi.

# SUBMISSION_APPROVAL_APPROVE_MULTIPLE_TYPE_LATE
source: Approve only late submissions
fi: Hyväksy vain myöhästyneet palautukset

# SUBMISSION_APPROVAL_APPROVE_MULTIPLE_TYPE_UNOFFICIAL
source: Approve only unofficial submissions
fi: Hyväksy vain epäviralliset palautukset

# SUBMISSION_APPROVAL_APPROVE_MULTIPLE_TYPE_ALL
source: Approve late and unofficial submissions
fi: Hyväksy myöhästyneet ja epäviralliset palautukset

source: Approve multiple submissions
fi: Hyväksy useita palautuksia pisteytetyiksi

source: Approve this submission
fi: Hyväksy tämä palautus pisteytetyksi

# REGRADE_DESCRIPTION
source: Regrade all or incomplete submissions for this assignment.
fi: Arvioi uudelleen kaikki tai kesken jääneet palautukset.

# START_REGRADE
source: Start regrading
fi: Aloita uudelleenarviointi

source: Re-submit to service
fi: Lähetä arvosteltavaksi uudelleen

# RE-SUBMIT_TO_SERVICE_DESCRIPTION
source: Click this button to re-submit this submission to the assessment service. This is meant to be used only in situations where the assessment service has behaved incorrectly so that the grading data is incorrect or the status of the submission never became ready. Caution! Re-submitting overwrites the current grading data.
fi: Tällä painikkeella voi lähettää palautuksen uudelleen tehtäväpalveluun. Toiminto on tarkoitettu käytettäväksi, kun tehtäväpalvelu on toiminut väärin, ja arvostelu on virheellinen tai tila ei muuttunut valmiiksi. Huomaa, että vanha arvostelu korvautuu uudella.

source: Submitted values
fi: Vastaukset

source: No values
fi: Ei ole

source: Grading data
fi: Arvostelun tiedot

source: Start manual assessment
fi: Aloita manuaalinen arvostelu

source: Summary
fi: Yhteenveto

source: Download points
fi: Lataa pisteet

source: Download submissions
fi: Lataa palautukset

source: Group by submitter
fi: Ryhmittele palauttajittain

source: graded
fi: arvosteltu

# NUMBER_ABBREVIATED
source: No.
fi: Nro

source: Compare
fi: Vertaa

source: Passed
fi: Läpäisty

# SUBMISSION_FINAL_TOOLTIP
source: This submission determines the final grade for this exercise.
fi: Tämä palautus määrittää tehtävän lopullisen arvosanan.

source: Final
fi: Lopullinen

# SUBMISSION_CHOSEN_TOOLTIP
source: At the moment this submission would determine the grade for the exercise.
fi: Tällä hetkellä tämä palautus määrittäisi tehtävän arvosanan.

# SUBMISSION_ASSESSED_TOOLTIP
source: This submission has been assessed manually by course staff.
fi: Kurssin henkilökunta on arvostellut tämän palautuksen manuaalisesti.

source: Assessed
fi: Arvosteltu

source: Show all submissions
fi: Näytä kaikki palautukset

source: Hide other submissions
fi: Piilota muut palautukset

source: Show individual submissions
fi: Näytä yksittäiset palautukset

source: Latest submission time
fi: Viimeisin palautusaika

source: No submitters
fi: Ei palauttajia

# PSEUDONYMIZATION_ERROR_MSG
source: This view is not available when pseudonymization is enabled!
fi: Tämä näkymä ei ole saatavilla kun pseudonymisointi on päällä!

source: Module selection
fi: Moduulin valinta

source: All
fi: Kaikki

source: View selection
fi: Näkymän valinta

source: Collective Progress
fi: Kollektiivinen edistyminen

source: Learning Trajectories
fi: Oppimiskäyrät

source: Table
fi: Taulukko

source: Download CSV
fi: Lataa CSV

source: Toggle Dropdown
fi: Näytä pudotusvalikko

source: Open API
fi: Avaa API

source: Clear selection
fi: Tyhjennä valinta

# PROGRESS_LABEL_<90%%_POINTS
source: < 90%% points
fi: < 90%% pisteistä

# PROGRESS_LABEL_>=90%%_POINTS
source: >= 90%% points
fi: >= 90%% pisteistä

source: Edit submitters SID
fi: Muokkaa palauttajia SID

source: Submission ID
fi: Palautus ID

source: Edit submitters
fi: Muokkaa palauttajia

# QUICK_SELECT_GROUP
source: Quick select a group
fi: Ryhmän pikavalinta

source: Inspect SID
fi: Tutki SID

# NOTE_FINAL_SUBMISSION
source: There is another submission that is marked as final.
fi: Toinen palautus on merkitty opiskelijan lopulliseksi palautukseksi.

# NOTE_BETTER_SUBMISSIONS
source: Another submission determines the grade for this assignment.
fi: Toinen palautus määrittää tämän tehtävän arvosanan.

# NOTE_LATER_SUBMISSIONS
source: There are newer submissions submitted by this student.
fi: Opiskelijalla on tätä palautusta uudempia palautuksia.

source: Assess next submitter manually
fi: Arvostele seuraava palauttaja manuaalisesti

# ADD_ONE_EXTRA_SUBMISSION_FOR_STUDENT_IN_EXERCISE
source: Add one extra submission for the student in this assignment.
fi: Lisää yksi uusi palautuskerta tälle opiskelijalle tähän tehtävään.

# COMPARING_TO_MODEL
source: Comparing to the model solution.
fi: Verrataan mallivastaukseen.

# COMPARING_TO_NOT_FOUND
source: The file you are attempting to compare to was not found.
fi: Tiedostoa, johon yrität verrata, ei löytynyt.

# COMPARING_TO_SUBMISSION -- %(cs_url)s, %(cs_date)s
source: Comparing to submission <a href="%(cs_url)s">%(cs_date)s</a>.
fi: Verrataan palautukseen <a href="%(cs_url)s">%(cs_date)s</a>.

# SHOW_ORIGINAL_SUBMISSION -- %(submission_url)s
source: Show the <a href="%(submission_url)s">original submission</a>.
fi: Näytä <a href="%(submission_url)s">alkuperäinen palautus</a>.

source: All submitters
fi: Kaikki palauttajat

source: Select modules:
fi: Valitse moduulit:

# SELECT_EXERCISES
source: Select assignments:
fi: Valitse tehtävät:

source: Options
fi: Valinnat

# UNOFFICIAL_POINTS_TOOLTIP
source: Points are official if the submission is within deadline and submission count limits. Unofficial submissions are allowed only if they have been enabled in the assignment category settings. KNOWN ISSUE: DO NOT PRESS this checkbox MORE THAN ONCE. If you do, the points table will keep showing UNOFFICIAL points.
fi: Pisteet ovat virallisia, jos palautus on tehty määräajassa ja sallittujen palautuskertojen sisällä. Epäviralliset palautukset ovat mahdollisia vain, jos epäviralliset palautukset on sallittu tehtäväkategorian asetuksissa. TUNNETTU ONGELMA: ÄLÄ PAINA tätä valintaa YLI YHDEN KERRAN. Jos tätä painetaan useammin kuin kerran, taulukko näyttää kuitenkin aina EPÄVIRALLISIA pisteitä.

# RESULTS_SHOW_UNOFFICIAL_POINTS
source: Include unofficial points
fi: Sisällytä epäviralliset pisteet

# UNCONFIRMED_POINTS_TOOLTIP
source: Points are unconfirmed if a mandatory exercise exists in the same chapter and the user has not passed it. Unconfirmed points exist only if mandatory activities have been enabled in the assignment category settings. Usually, mandatory activities are used for mandatory chapter feedback questionnaires.
fi: Pisteet ovat vahvistamattomia, jos samassa luvussa on pakollinen tehtävä ja käyttäjä ei ole päässyt sitä läpi. Vahvistamattomia pisteitä on olemassa vain, jos tehtäväkategoriassa on asetettu pakolliset osiot. Yleensä pakollisia osioita käytetään pakollisiin palautelomakkeisiin lukujen lopussa.

# RESULTS_SHOW_UNCONFIRMED_POINTS
source: Include unconfirmed points
fi: Sisällytä vahvistamattomat pisteet

# RESULTS_SHOW_ONLY_STUDENT_WITH_SUBMISSIONS
source: Show only students with submissions
fi: Näytä vain palauttaneet opiskelijat

# RESULTS_IGNORE_GRADING_MODE_LAST_TOOLTIP
source: If this is checked, the points shown ignore the grading mode &quot;last&quot; even if it has been enabled for some assignment.
fi: Jos tämä on valittuna, näytetyt pisteet eivät huomioi arvostelutapaa &quot;vain viimeinen palautus&quot;, vaikka se olisi jossain tehtävässä asetettuna.

# RESULTS_IGNORE_GRADING_MODE_LAST
source: Ignore last-only grading mode in assignments
fi: Älä huomioi "vain viimeisen palautuksen" arvostelutapaa

source: Summaries
fi: Yhteenvedot

# SUMMARIES_SELECT_OR_DESELECT_ALL
source: Select or deselect all summaries.
fi: Valitse kaikki yhteenvedot tai poista valinta kaikista

# RESULTS_TOTAL_SUBMISSIONS_TOOLTIP
source: Total number of submissions. Calculates all student submission counts together.
fi: Palautusten lukumäärä. Laskee kaikkien opiskelijoiden kaikkien palautusten lukumäärän yhteen.

source: Total submissions
fi: Palautuksia yhteensä

# RESULTS_AVERAGE_SUBMISSIONS_PER_STUDENT_TOOLTIP
source: How many submissions a single student has used on the assignment on average. Only accounts for students with one or more submissions.
fi: Kuinka monta palautusta opiskelija on käyttänyt tehtävään keskimäärin. Lasketaan vain opiskelijat, joilla on vähintään yksi palautus.

source: Average submissions per student
fi: Palautuskertojen keskiarvo per opiskelija

# RESULTS_MAXIMUM_SUBMISSIONS_TOOLTIP
source: Maximum number of available submissions for the assignment.
fi: Kuinka monta palautusta tehtävässä on mahdollista käyttää.

source: Maximum submissions
fi: Palautusmahdollisuuksia

# RESULTS_STUDENTS_W_SUBMISSIONS_TOOLTIP
source: Number of students that have one or more assignment submissions.
fi: Opiskelijat, joilla on vähintään yksi palautus.

# STUDENTS_W_SUBMISSIONS
source: Students with submissions
fi: Tehtävän palauttaneet opiskelijat

# RESULTS_STUDENTS_W_MAX_POINTS_TOOLTIP
source: Number of students that have received maximum points from the assignment.
fi: Opiskelijat, jotka ovat saaneet täydet pisteet tehtävästä.

# STUDENTS_W_MAX_POINTS
source: Students with max points
fi: Opiskelijat, joilla on täydet pisteet

# RESULTS_AVERAGE_POINTS_PER_STUDENT_TOOLTIP
source: Average points received for the assignment per student. Only accounts for students with one or more submissions.
fi: Kuinka monta pistettä opiskelijat ovat saaneet tehtävästä keskimäärin. Lasketaan vain opiskelijat, joilla on vähintään yksi palautus.

source: Average points per student
fi: Pisteiden keskiarvo per opiskelija

# RESULTS_MAX_POINTS_TOOLTIP
source: Maximum points for the assignment.
fi: Tehtävän enimmäispisteet.

# MAX_POINTS
source: Maximum points
fi: Enimmäispisteet

# RESULTS_SHOW_EXERCISES_BY_DIFFICULTY
source: Show assignments by difficulty
fi: Näytä tehtävät vaikeusasteittain

# RESULTS_SHOW_EXERCISES_BY_MODULE
source: Show assignments by module
fi: Näytä tehtävät moduulettain

# RESULTS_SHOW_ALL_EXERCISES
source: Show all assignments
fi: Näytä kaikki tehtävät

source: Submissions summary
fi: Palautusten yhteenveto

source: Last name
fi: Sukunimi

source: First name
fi: Etunimi

source: Email
fi: Sähköposti

source: Submission
fi: Palautus

# FILES_IN_SUBMISSION
source: Files in this submission
fi: Tiedostot tässä palautuksessa

# NO_GRADER_FEEDBACK_FOR_SUBMISSION
source: No grader feedback available for this submission.
fi: Tästä palautuksesta ei ole saatavilla palautetta.

# RETURN_TO_EXERCISE
source: Return to assignment
fi: Palaa tehtävään

source: Date
fi: Päiväys

source: Files
fi: Tiedostot
