Repository: apluslms/a-plus
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi

# MODEL_NAME_NEWS_PLURAL
source: news items
fi: uutiset

source: Add news item
fi: Lisää uutinen

source: News
fi: Uutiset

source: Publish
fi: Julkaise

source: Audience
fi: Yleisö

source: Title
fi: Otsikko

source: Remove selected news items
fi: Poista valitut uutiset

source: Course news
fi: Kurssiuutiset

# NEWS_ITEM_PINNED_SR_TEXT
source: Pinned news item on top of the list
fi: Listan kärkeen nostettu viesti

source: Published on
fi: Julkaisu

source: Show older
fi: Näytä aiemmat

# FAILED_TO_SEND_EMAIL
source: Sending email failed.
fi: Sähköpostin lähettäminen epäonnistui.

# LABEL_SUBJECT
source: subject
fi: aihe

# LABEL_NOTIFICATION
source: notification
fi: ilmoitus

# LABEL_SENDER
source: sender
fi: lähettäjä

# LABEL_RECIPIENT
source: recipient
fi: vastaanottaja

# LABEL_SEEN
source: seen
fi: nähty

# LABEL_REGRADE_WHEN_SEEN
source: regrade when seen
fi: arvioi uudestaan kun nähty

# MODEL_NAME_NOTIFICATION
source: notification
fi: ilmoitus

# MODEL_NAME_NOTIFICATION_PLURAL
source: notifications
fi: ilmoitukset

source: You have
fi: Sinulla on

source: new notification
fi: uusi ilmoitus

# SHIBBOLETH_ERROR_LOGIN_FAILED_META_HEADERS_MISSING
source: Failed to login the user. Shibboleth META headers missing. Check the Apache mod_shibd is active and /shibboleth is protected.
fi: Käyttäjän kirjaaminen sisään epäonnistui. Shibboleth META otsikot puuttuvat. Tarkista että Apache mod_shibd on aktiivinen ja /shibboleth on suojattu.

# SHIBBOLETH_ERROR_USER_ACCOUNT_DISABLED
source: The user account has been disabled.
fi: Käyttäjätili on poistettu käytöstä.

# LABEL_ALERT
source: alert
fi: varoitus

# MODEL_NAME_SITEALERT
source: site alert
fi: sivustovaroitus

# MODEL_NAME_SITEALERT_PLURAL
source: site alerts
fi: sivustovaroitukset

# ACCESS_RESTRICTED_403
source: Access restricted
fi: Pääsy kielletty

# ACCESS_RESTRICTED_403_INFO
source: You lack the necessary permissions to view this content. If you have a user ID, remember to log in.
fi: Sinulla ei ole tarvittavia oikeuksia nähdäksesi tätä sisältöä. Muistathan kirjautua sisään, jos sinulla on käyttäjätunnus.

# NOT_FOUND_404
source: Page not found
fi: Sivua ei löytynyt

# PAGE_NOT_AVAILABLE_IN_LANGUAGE
source: The page is not available in this language.
fi: Sivu ei ole saatavilla tällä kielellä.

# OPEN_PAGE_IN_DEFAULT_LANGUAGE
source: Open the page in default language
fi: Avaa sivu oletuskielellä

# PAGE_NOT_AVAILABLE_IN_LANGUAGE_BUT_AVAILABLE_IN_THESE
source: The course is not available in this language. You can view the course in these languages:
fi: Kurssi ei ole saatavilla tällä kielellä. Voit katsella kurssia näillä kielillä:

# PAGE_DOES_NOT_EXIST
source: For an unknown reason you arrived somewhere that does not exist. Please, try again.
fi: Olet päätynyt tuntemattomasta syystä osoitteeseen, jota ei ole olemassa. Ole ystävällinen, ja yritä uudelleen.

# INTERNAL_SERVER_ERROR_500
source: Internal server error
fi: Palvelimen sisäinen virhe

source: Import list
fi: Tuo lista

source: No matches
fi: Ei osumia

# SEARCH_OR_PASTE
source: Enter a search term or paste a list
fi: Kirjoita hakusana tai liitä lista

# COPY_SELECTION
source: Copy all selected
fi: Kopioi nykyinen valinta

source: Skip main navigation
fi: Ohita päävalikko

source: Main
fi: Päävalikko

source: Select course
fi: Valitse kurssi

source: Theme
fi: Teema

source: Light
fi: Vaalea

# DARK
source: Dark (experimental)
fi: Tumma (kokeellinen)

source: System
fi: Järjestelmä

source: Change language to English
fi: Vaihda kieli englanniksi

source: Change language to Finnish
fi: Vaihda kieli suomeksi

# PROFILE
source: Account
fi: Käyttäjätili

source: Log out
fi: Kirjaudu ulos

source: Log in
fi: Kirjaudu sisään

source: Toggle navigation
fi: Näytä valikko

source: Privacy Notice
fi: Tietosuojailmoitus

source: Cookie Notice
fi: Evästeilmoitus

source: Accessibility Statement
fi: Saavutettavuusseloste

source: Support
fi: Tuki

source: Feedback
fi: Palaute

source: Loading failed!
fi: Lataus epäonnistui!

source: Teachers
fi: Opettajat

# MANUAL -- %(brand_long)s
source: %(brand_long)s manual
fi: %(brand_long)s-opas

# MANUAL_DESCRIPTION
source: for course and assignment authors
fi: kurssien ja tehtävien kehittäjille

source: Contact support by email:
fi: Ota yhteyttä tukeen sähköpostilla:

# GIVE_FEEDBACK
source: Give feedback or report an issue
fi: Anna palautetta tai ilmoita ongelmasta

source: Students
fi: Opiskelijat

# CONTACT_COURSE_STAFF_FOR_ASSISTANCE_ON_COURSE_MATTERS
source: Students should contact the course staff for further assistance on course matters. If there are technical issues in the course materials, contact the course staff. Check the course page for the contact information.
fi: Opiskelijat saavat tukea kurssin sisäisissä asioissa kurssin henkilökunnalta. Jos kurssin oppimateriaalissa on teknisiä ongelmia, ota yhteyttä kurssin henkilökuntaan. Tarkista henkilökunnan yhteystiedot kurssin verkkosivuilta.

# A+_LMS_PROJECT_WEBSITE
source: About the A+ project
fi: Tietoja A+ - projektista

# LABEL_PASSED_MODULES
source: passed modules
fi: läpäistyt moduulit

# LABEL_PASSED_CATEGORIES
source: passed categories
fi: läpäistyt kategoriat

# LABEL_PASSED_EXERCISES
source: passed assignments
fi: läpäistyt tehtävät

# LABEL_CONSUME_HARDER_POINTS
source: consume harder points
fi: käytä vaativampia pisteitä

# HARDER_POINTS_CONSUMED_BY_EASIER_DIFFICULTY_REQUIREMENTS
source: Harder points are consumed by easier difficulty requirements.
fi: Vaativammat pisteet käytetään helpompien vaatimuksien täyttöön.

# MODEL_NAME_THRESHOLD
source: threshold
fi: kynnysehto

# MODEL_NAME_THRESHOLD_PLURAL
source: thresholds
fi: kynnysehdot

# LABEL_THRESHOLD
source: threshold
fi: kynnysehto

# LABEL_LIMIT
source: limit
fi: raja

# MODEL_NAME_THRESHOLD_POINTS
source: threshold points
fi: kynnysehdon pisteet

# MODEL_NAME_THRESHOLD_POINTS_PLURAL
source: threshold points
fi: kynnysehtojen pisteet

# POINTS -- {:d}
source: {:d} points
fi: {:d} pisteet

# LABEL_NEGATIVE
source: negative
fi: negatiivinen

# MODEL_NAME_COURSE_MODULE_REQUIREMENT
source: course module requirement
fi: kurssimoduulin vaatimus

# MODEL_NAME_COURSE_MODULE_REQUIREMENT_PLURAL
source: course module requirements
fi: kurssimoduulien vaatimukset

# LABEL_STUDENT_ID
source: student ID
fi: opiskelijanumero

# LABEL_ORGANIZATION
source: organization
fi: organisaatio

# MODEL_NAME_USER_PROFILE
source: user profile
fi: käyttäjätili

# MODEL_NAME_USER_PROFILE_PLURAL
source: user profiles
fi: käyttäjätilit

source: Log in to %(brand_name)s
fi: Kirjaudu %(brand_name)s-järjestelmään

source: Log in using Google
fi: Kirjaudu Google-tunnuksella

source: Local users
fi: Paikalliset käyttäjät

# LOCAL_USER_LOGIN_DESCRIPTION -- %(brand_name)s
source: If you have been provided with credentials specifically for %(brand_name)s, use this login.
fi: Mikäli sinulla on tunnukset yksinomaan %(brand_name)s-palvelua varten, kirjaudu sisään tästä.

source: Close error list
fi: Sulje virheluettelo

source: Password
fi: Salasana

source: Show more login options
fi: Näytä lisää kirjautumisvaihtoehtoja

source: Logged out
fi: Olet kirjautunut ulos

# LOGGED_OUT_SUCCESSFULLY
source: You have successfully logged out. Please close the browser if you were using a public computer to clear your remaining sessions.
fi: Olet kirjautunut onnistuneesti ulos palvelusta. Jos käytät julkista tietokonetta, sulje selain poistaaksesi istunnon tiedot.

source: [Unknown name]
fi: [Tuntematon nimi]

# BRAND_PREFERENCES -- %(brand_name)s
source: %(brand_name)s Preferences
fi: %(brand_name)s-asetukset

source: API Access Token
fi: API-käyttöoikeustietue

source: Copy API Access Token
fi: Kopioi API-käyttöoikeustietue

source: Copy
fi: Kopioi

# REGENERATE_API_ACCESS_TOKEN
source: Generate a new API Access Token
fi: Generoi uusi API-käyttöoikeustietue

source: Regenerate
fi: Uudelleengeneroi

source: Automatic redirections
fi: Automaattiset uudelleenohjaukset

# AUTOMATIC_REDIRECTIONS_NO_SERVICES_MARKED_ON_DEVICE
source: No services marked for automatic redirection on this device.
fi: Tällä laitteella ei ole sallittu automaattista uudelleenohjausta millekään palvelulle.

# AUTOMATIC_REDIRECTIONS_FORGET
source: Forget automatic redirection
fi: Unohda automaattinen uudelleenohjaus

source: Information provided by your organization
fi: Organisaatioltasi saadut tiedot

source: Information provided by Google
fi: Googlen toimittamat tiedot

# SETTINGS_CAN_BE_CHANGED_BY_IDENTITY_PROVIDER
source: The following settings can be changed by your identity provider.
fi: Seuraavat asetukset voi muuttaa tunnistustietojen tarjoajan järjestelmässä.

source: [Missing]
fi: [Puuttuu]

source: Organization
fi: Organisaatio

# BRAND_SUPPORT -- %(brand_name)s
source: %(brand_name)s Support
fi: %(brand_name)s tuki

source: Teacher list
fi: Opettajalista

source: List active teachers
fi: Listaa aktiiviset opettajat

source: Course date range
fi: Kurssin aikaväli

# DATE_RANGE_START
source: Start of date range
fi: Aikavälin alku

# DATE_RANGE_END
source: End of date range
fi: Aikavälin loppu

source: Include assistants
fi: Sisällytä assistentit

# FORM
source: Apply
fi: Hae

source: Export table data
fi: Vie taulukon tiedot

source: Emails only
fi: Vain sähköpostit

source: Starting time
fi: Alkamisaika

source: Ending time
fi: Päättymisaika

# NO_PRIVACY_NOTICE
source: No privacy notice. Please notify administration!
fi: Ei tietosuojailmoitusta. Ota yhteys ylläpitäjään!

# NO_COOKIE_NOTICE
source: No cookie notice. Please notify administration!
fi: Ei evästeilmoitusta. Ota yhteys ylläpitäjään!

# NO_LOCAL_ACCESSIBILITY_STATEMENT
source: No local accessibility statement. Please notify the site's owner!
fi: Ei paikallista saavutettavuusselostetta. Ilmoitathan tästä sivuston ylläpitäjälle!

# NO_SYSTEM-WIDE_ACCESSIBILITY_STATEMENT
source: No system-wide accessibility statement found.
fi: Järjestelmätason saavutettavuusselostetta ei löytynyt.

# NO_SUPPORT_PAGE
source: No support page. Please notify administration!
fi: Ei tukisivua. Ota yhteys ylläpitäjään!
