Repository: apluslms/a-plus
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi

# ENROLL_TO_SUBMIT_EXERCISES
source: In order to submit assignments you must enrol in the course.
fi: Palauttaaksesi tehtäviä sinun pitää ilmoittautua kurssille.

# ENROLL_TO_SUBMIT_EXERCISES_AND_SEE_MATERIAL
source: In order to submit assignments and see material, you must enrol in the course.
fi: Palauttaaksesi tehtäviä ja nähdäksesi materiaalin sinun pitää ilmoittautua kurssille.

# ENROLL
source: Enrol
fi: Ilmoittaudu

# ENROLLMENT_OPEN_UNTIL -- %(end)s
source: The course enrolment is open until %(end)s.
fi: Kurssille ilmoittautuminen on avoinna %(end)s asti.

# ENROLLMENT_HAS_ENDED
source: Unfortunately, enrolling in the course has ended.
fi: Valitettavasti kurssille ilmoittautuminen on päättynyt.

# COURSE_OPENS -- %(start)s
source: The course opens %(start)s.
fi: Kurssi avautuu %(start)s.

# ENROLLMENT_AND_CONTENT_EXPLORATION_NOT_ALLOWED
source: Unfortunately, you may not enrol in this course and you may not explore the contents either.
fi: Valitettavasti et voi ilmoittautua tälle kurssille etkä voi myöskään selailla kurssimateriaalia.

# ENROLLMENT_NOT_ALLOWED_BUT_CAN_EXPLORE_CONTENT
source: Unfortunately, you cannot enrol in this course, but you may explore the course material.
fi: Valitettavasti et voi ilmoittautua tälle kurssille, mutta voit selailla kurssimateriaalia.

# LOGIN_REQUIRED_FOR_SUBMISSIONS_BUT_CAN_EXPLORE_CONTENT
source: Login is required to submit assignments, but you may anonymously explore the course material.
fi: Tehtävien palauttaminen vaatii kirjautumisen järjestelmään, mutta voit selailla kurssimateriaalia tunnistautumatta.

# GROUP_SUBMITTING_WITH -- %(collaborators)s
source: Submitting with %(collaborators)s.
fi: Palauttamassa ryhmässä: %(collaborators)s

# GROUP_SUBMITTING_ALONE
source: Submitting alone.
fi: Palauttamassa yksin.

# GROUP_LOADER_REGISTERING_SELECTION
source: Registering selection...
fi: Tallennetaan valintaa...

source: Submit alone
fi: Palauta yksin

source: Submit with %(collaborators)s
fi: Palauta ryhmässä: %(collaborators)s

source: Search courses
fi: Hae kursseja

source: Clear search
fi: Tyhjennä haku

source: Search
fi: Hae

source: Pagination
fi: Sivuilla siirtyminen

source: Early access
fi: Aikainen pääsy

source: Course archive
fi: Kurssiarkisto

source: No courses found.
fi: Kursseja ei löytynyt.

source: Expand sidebar
fi: Laajenna sivupalkki

source: Read more
fi: Lue lisää

# COURSE_HAS_ALREADY_ENDED
source: This course has already ended.
fi: Tämä kurssi on jo päättynyt.

# LATEST_COURSE_INSTANCE_CAN_BE_FOUND
source: The latest instance of the course can be found at:
fi: Kurssin viimeisimmän version löydät täältä:

source: You are browsing this course in a different language (%(display_lang)s) than is set in your account preferences (%(pref_lang)s).
fi: Katselet kurssia eri kielellä (%(display_lang)s) kuin minkä olet asettanut ensisijaiseksi kieleksesi asetuksissasi (%(pref_lang)s).

# LANGUAGE_BROWSE_COURSE_IN -- %(lang)s
source: Browse the course in %(lang)s
fi: Selaa kurssia kielellä %(lang)s

# LANGUAGE_SET_COURSE_LANGUAGE -- %(lang)s
source: Set %(lang)s as course language
fi: Aseta kurssikieleksi %(lang)s

# LANGUAGE_CAN_BE_CHANGED_FROM_PROFILE
source: You can change the language from your account page.
fi: Voit muuttaa kielivalintaa käyttäjäasetuksissasi.

source: Breadcrumb
fi: Linkkipolku

source: Course instances
fi: Kurssikerrat

# ENROLLMENT
source: Enrolment
fi: Ilmoittautuminen

# ENROLLMENT_IS_ALREADY_ENROLLED
source: You are already enrolled in this course.
fi: Olet jo ilmoittautunut tälle kurssille.

# ENROLLMENT_TARGET_GROUP
source: Enrolment target group
fi: Ilmoittautumisen kohderyhmä

# ENROLLMENT_OPEN_BETWEEN -- %(start)s, %(end)s
source: Enrolment is open from %(start)s to %(end)s.
fi: Ilmoittautuminen on avoinna alkaen %(start)s ja päättyen %(end)s.

source: Course visibility
fi: Kurssin näkyvyys

source: My groups
fi: Minun ryhmäni

source: [staff has none]
fi: [henkilökunnalla ei ole]

# GROUP_PERSONAL_JOIN_CODE -- %(code)s
source: Your personal group <strong>join code</strong> is <strong>%(code)s</strong>.
fi: Henkilökohtainen ryhmään <strong>liittymiskoodisi</strong> on <strong>%(code)s</strong>.

# GROUP_CREATION_INSTRUCTIONS
source: First, query the personal <strong>join codes</strong> from your other group members. Then enter the codes below to form a new group. It is sufficient that one group member submits this form.
fi: Kysy ensin henkilökohtainen <strong>liittymiskoodi</strong> muilta ryhmän jäseniltäsi. Muodosta ryhmä syöttämällä koodit alle. Riittää, että yksi ryhmän jäsen lähettää tämän lomakkeen.

# GROUP_FORM_NEW
source: Form a new group
fi: Muodosta uusi ryhmä

# GROUP_SUBMISSIONS_NOT_USED_ON_COURSE
source: This course does not utilize group submissions.
fi: Tällä kurssilla ei voi palauttaa ryhmänä.

source: No groups yet
fi: Ei vielä ryhmiä

source: My courses
fi: Minun kurssini

# MY_COURSES_EMPTY
source: You do not currently have any ongoing courses.
fi: Sinulla ei ole käynnissä olevia kursseja.

source: All ongoing courses
fi: Meneillään olevat kurssit

source: See all courses
fi: Näytä kaikki kurssit

# LATE_SUBMISSIONS_ALLOWED_UNTIL -- %(deadline)s
source: Late submissions are allowed until %(deadline)s.
fi: Myöhästyneitä palautuksia vastaanotetaan %(deadline)s asti.

# LATE_SUBMISSION_POINTS_WORTH -- %(percent)s
source: However, points are only worth %(percent)s%%.
fi: Pisteiden arvo on %(percent)s%% ajoissa palautetusta.

source: Untag multiple users
fi: Poista merkintä usealta käyttäjältä

# REMOVE_TAGGING_FROM_USERS_MODAL
source: Remove tagging <span id="tag-remove-modal-tagging"></span> from <span id="tag-remove-modal-amount"></span> users: <ul id="tag-remove-modal-users"></ul>
fi: Poistetaan merkintä <span id="tag-remove-modal-tagging"></span> <span id="tag-remove-modal-amount"></span> käyttäjältä: <ul id="tag-remove-modal-users"></ul>

source: Cancel
fi: Peruuta

source: Remove all
fi: Poista kaikki

# NUM_OF_SUBMISSIONS_DISPLAYED -- %(count)s
source: %(count)s submissions.
fi: %(count)s palautusta.

# NUM_OF_SUBMISSIONS_DISPLAYED_AND_SHOW_ALL_BTN -- %(limit)s, %(url)s
source: %(limit)s latest submissions. <a class="aplus-button--secondary aplus-button--xs" role="button" href="%(url)s">Show all</a>
fi: %(limit)s viimeisintä palautusta. <a class="aplus-button--secondary aplus-button--xs" role="button" href="%(url)s">Näytä kaikki</a>

source: %(count)s submissions. <a class="aplus-button--secondary aplus-button--xs" role="button" href="%(url)s">Show latest %(limit)s</a>
fi: %(count)s palautusta. <a class="aplus-button--secondary aplus-button--xs" role="button" href="%(url)s">Näytä %(limit)s viimeisintä</a>

source: Filter submissions by tag
fi: Suodata listaa merkinnän perusteella

source: Submitters
fi: Opiskelijat

source: Time
fi: Aika

source: Status
fi: Tila

source: Grade
fi: Arvosana

source: Tags
fi: Merkinnät

source: Yes
fi: Kyllä

source: No
fi: Ei

source: Assessed manually
fi: Arvosteltu manuaalisesti

source: Inspect
fi: Tutki

# EXERCISE
source: Assignment
fi: Tehtävä

# LATE_W_PENALTY -- %(percent)s
source: Late <small>-%(percent)s%%</small>
fi: Myöhässä <small>-%(percent)s%%</small>

source: No submissions
fi: Ei vielä palautuksia

# ENROLL_STUDENTS
source: Enrol students
fi: Ilmoita opiskelijoita

# ENROLL_STUDENTS_MANUALLY_DESCRIPTION
source: Teacher may manually enrol students in the course here. Enrolment time and audience restrictions do not apply here. If the course has an enrolment assignment, the manually enrolled students are not required to submit anything.
fi: Opettajat voivat lisätä täällä opiskelijoita kurssille käsin. Ilmoittautumisen aikaraja tai kohdeyleisö eivät estä opiskelijan käsin lisäämistä. Jos kurssilla on ilmoittautumistehtävä, käsin lisätyt opiskelijat eivät joudu vastaamaan siihen.

# ENROLL_STUDENTS_IN_COURSE
source: Enrol students in the course
fi: Ilmoita opiskelijoita kurssille

source: Remove
fi: Poista

source: Confirm group removal
fi: Vahvista ryhmän poisto

source: Members
fi: Jäsenet

source: Created
fi: Luotu

source: Edit
fi: Muokkaa

source: Edit group members
fi: Muokkaa ryhmän jäseniä

source: Save
fi: Tallenna

source: Number of groups
fi: Ryhmien määrä

source: Add new
fi: Lisää

source: Filter users by tag
fi: Suodata listaa merkinnän perusteella

source: Filter users by status
fi: Suodata listaa tilan perusteella

# NUMBER_OF_ENROLLED_STUDENTS
source: Enrolled active students:
fi: Ilmoittautuneita aktiivisia opiskelijoita:

# PENDING_STUDENTS
source: Pending:
fi: Odottavia:

# REMOVED_STUDENTS
source: Removed:
fi: Poistettuja:

# BANNED_STUDENTS
source: Banned:
fi: Estettyjä:

# OF_WHICH_SELECTED
source: Currently selected:
fi: Tällä hetkellä valittuja:

source: Add student tag
fi: Lisää opiskelijamerkintä

source: Remove student tag
fi: Poista opiskelijamerkintä

source: Select
fi: Valitse

# ENROLLMENT_REMOVE_MODAL_REMOVE_TITLE
source: Remove student
fi: Poista opiskelija

# ENROLLMENT_REMOVE_MODAL_BAN_TITLE
source: Ban student
fi: Estä opiskelija

# ENROLLMENT_REMOVE_MODAL_REMOVE_DESCRIPTION
source: <p>Are you sure you want to remove this user from the course?</p><p>Removed users can re-enrol in the course, as long as the course enrolment is open.</p>
fi: <p>Haluatko varmasti poistaa tämän käyttäjän kurssilta?</p><p>Poistetut käyttäjät pystyvät ilmoittautumaan kurssille uudelleen ilmoittautumisen ollessa auki.</p>

# ENROLLMENT_REMOVE_MODAL_BAN_DESCRIPTION
source: <p>Are you sure you want to ban this user from the course?</p><p>Banned users cannot re-enrol in the course.</p>
fi: <p>Haluatko varmasti estää tämän käyttäjän pääsyn kurssille?</p><p>Estetyt käyttäjät eivät pysty ilmoittautumaan kurssille uudelleen.</p>

# GRADER_PROBLEMS_ALERT -- {exercises}
source: Automatic grading currently has issues. You may experience delay in receiving feedback. Affected exercises include at least {exercises}.
fi: Automaattisessa arvioinnissa on tällä hetkellä ongelmia. Palautteen saamisessa saattaa esiintyä viivettä. Ongelmia on havaittu ainakin tehtävissä {exercises}.

# COURSE_INSTANCES_NOT_VISIBLE_TO_STUDENTS
source: The course instances of this course are not visible to students.
fi: Kurssikerrat eivät ole opiskelijoiden nähtävissä.

# NO_COURSE_INSTANCES_OF_COURSE
source: There are no course instances for this course.
fi: Tällä kurssilla ei ole kurssikertaa.

# ENROLLMENT_ERROR_CANNOT_ENROLL_OR_ALREADY_ENROLLED
source: You cannot enrol, or have already enrolled, in this course.
fi: Et voi ilmoittautua tai olet jo ilmoittautunut tälle kurssille.

# ENROLLMENT_ERROR_ENROLLMENT_NOT_OPEN
source: The enrolment is not open.
fi: Ilmoittautuminen ei ole avoinna.

# UNENROLL_SUCCESS -- {course}
source: Successfully unenrolled from course {course}.
fi: Ilmoittautuminen poistettiin onnistuneesti kurssilta {course}.

# UNENROLL_ERROR_ONLY_ENROLLED
source: Only enrolled students can unenrol.
fi: Vain ilmoittautuneet opiskelijat voivat poistaa ilmoittautumisen.

# NEW_STUDENT_GROUP_CREATED
source: A new student group was created.
fi: Luotiin uusi opiskelijaryhmä.

# LABEL_MODULE
source: Module
fi: Moduuli

# LABEL_EXERCISE
source: Assignment
fi: Tehtävä

# LABEL_SUBMITTER_TAG
source: Submitter tag
fi: Opiskelijamerkintä

# LABEL_SUBMITTER
source: Submitter
fi: Opiskelija

# EXERCISES_AND_MODULES_MISSING
source: You need to define exercises or modules.
fi: Valitse tehtävät tai moduulit.

# SUBMITTERS_AND_TAGS_MISSING
source: You have to define submitters or tags.
fi: Valitse opiskelijat tai merkinnät.

# LABEL_SECONDS
source: Extra time
fi: Ylimääräistä palautusaikaa

# DEVIATION_EXTRA_SECONDS_HELPTEXT
source: Amount of extra time given. Leave blank if you fill in the date below.
fi: Annettu ylimääräinen palautusaika. Jätä tyhjäksi mikäli ilmoitat määräajan alempana.

# LABEL_NEW_DEADLINE
source: New deadline
fi: Uusi määräaika

# DEVIATION_NEW_DEADLINE_DATE_HELPTEXT
source: New submission deadline.
fi: Uusi määräaika.

# LABEL_WITHOUT_LATE_PENALTY
source: Do not apply late penalty during extra time.
fi: Älä käytä myöhästymissakkoa ylimääräisen palautusajan aikana.

# DEVIATION_MODULE_ADD_HELPTEXT
source: List a module or modules here if you wish the deviation to be applied to all of the assignments in the module(s).
fi: Ilmoita tässä moduuli tai moduulit, mikäli haluat, että poikkeamaa sovelletaan kaikkiin moduulin tehtäviin.

# DEVIATION_EXERCISE_ADD_HELPTEXT
source: List the assignment or assignments to which the deviation should be applied. If you have also listed a module or modules in the field above, the deviation will be applied to these assignments IN ADDITION to the listed module(s).
fi: Ilmoita tässä tehtävä tai tehtävät, johon haluat poikkeamaa sovellettavan. Mikäli olet ilmoittanut myös moduuli-kentässä moduulin tai moduuleja, poikkeamaa sovelletaan näihin tehtäviin kyseisten moduulien LISÄKSI.

# DEVIATION_SUBMITTER_TAG_ADD_HELPTEXT
source: List a tag or tags here if you wish the deviation to be granted to all students with one of the listed tags.
fi: Ilmoita tässä merkintä tai merkinnät, mikäli haluat, että poikkeama myönnetään kaikille opiskelijoille, joilla on jokin merkinnöistä.

# DEVIATION_SUBMITTER_ADD_HELPTEXT
source: List the student or students to whom the deviation should be granted. If you have also listed a tag or tags in the field above, the deviation will be granted to these students IN ADDITION to the ones with the tags.
fi: Ilmoita tässä opiskelija tai opiskelijat, joille haluat myöntää poikkeaman. Mikäli olet ilmoittanut myös opiskelijamerkintä-kentässä merkinnän tai merkintöjä, poikkeama myönnetään näille opiskelijoille niiden LISÄKSI, joilla on kyseiset merkinnät.

# SECONDS_AND_DATE_MISSING
source: You have to provide either the extra time or a date in the future.
fi: Syötä joko ylimääräinen palautusaika tai uusi määräaika.

# LABEL_EXTRA_SUBMISSIONS
source: Extra submissions
fi: Ylimääräisiä palautuskertoja

# DEVIATION_MODULE_REMOVE_HELPTEXT
source: List a module or modules here if you wish to remove the deviations from all of the assignments in the module(s).
fi: Ilmoita tässä moduuli tai moduulit, mikäli haluat, että poikkeamat poistetaan kaikista moduulin tehtävistä.

# DEVIATION_EXERCISE_REMOVE_HELPTEXT
source: List the assignment or assignments from which deviations should be removed. If you have also listed a module or modules in the field above, the deviations will be removed from these assignments IN ADDITION to the listed module(s).
fi: Ilmoita tässä tehtävä tai tehtävät, joista haluat poistaa poikkeamat. Mikäli olet ilmoittanut myös moduuli-kentässä moduulin tai moduuleja, poikkeamat poistetaan näistä tehtävistä kyseisten moduulien LISÄKSI.

# DEVIATION_SUBMITTER_TAG_REMOVE_HELPTEXT
source: List a tag or tags here if you wish to remove the deviations from all of the students with one of the listed tags.
fi: Ilmoita tässä merkintä tai merkinnät, mikäli haluat, että poikkeama poistetaan kaikilta opiskelijoilta, joilla on jokin merkinnöistä.

# DEVIATION_SUBMITTER_REMOVE_HELPTEXT
source: List the student or students from whom the deviations should be removed. If you have also listed a tag or tags in the field above, the deviations will be removed from these students IN ADDITION to the ones with the tags.
fi: Ilmoita tässä opiskelija tai opiskelijat, joilta haluat poistaa poikkeamat. Mikäli olet ilmoittanut myös opiskelijamerkintä-kentässä merkinnän tai merkintöjä, poikkeamat poistetaan näiltä opikselijoilta niiden LISÄKSI, joilla on kyseiset merkinnät.

# LABEL_GRANTER
source: Granter
fi: Myöntäjä

# LABEL_GRANT_TIME
source: Grant time
fi: Myöntämisaika

# MODEL_NAME_SUBMISSION_RULE_DEVIATION
source: submission rule deviation
fi: palautussäännön poikkeama

# MODEL_NAME_SUBMISSION_RULE_DEVIATION_PLURAL
source: submission rule deviations
fi: palautusääntöjen poikkeamat

# LABEL_EXTRA_SECONDS
source: extra seconds
fi: ylimääräiset sekunnit

# MODEL_NAME_DEADLINE_RULE_DEVIATION
source: deadline rule deviation
fi: määräajan poikkeama

# MODEL_NAME_DEADLINE_RULE_DEVIATION_PLURAL
source: deadline rule deviations
fi: määräaikojen poikkeamat

# MODEL_NAME_MAX_SUBMISSIONS_RULE_DEVIATION
source: max submissions rule deviation
fi: enimmäispalautuskertojen poikkeama

# MODEL_NAME_MAX_SUBMISSIONS_RULE_DEVIATION_PLURAL
source: max submissions rule deviations
fi: enimmäispalautuskertojen poikkeamat

source: Remove selected deviations
fi: Poista valitut poikkeamat

source: Close
fi: Sulje

# SOME_DEVIATIONS_ARE_HIDDEN_WARNING
source: Some of the selected deviations are currently hidden due to filtering. Clear the filter to see the hidden deviations and ensure you have selected only the deviations you want to delete.
fi: Jotkut valituista poikkeamista ovat tällä hetkellä poissa näkyvistä suodatuksen takia. Tyhjennä suodatus nähdäksesi poikkeamat ja varmistaaksesi, että olet valinnut vain ne poikkeamat, jotka haluat poistaa.

# NO_DEVIATIONS_SELECTED_WARNING
source: No deviations were selected. Select one or more deviations to delete them.
fi: Ei valittuja poikkeamia. Valitse yksi tai useampi poikkeama poistaaksesi ne.

source: Add deadline deviations
fi: Lisää määräaikojen poikkeamia

source: List deadline deviations
fi: Listaa määräaikojen poikkeamat

source: Add new deadline deviations
fi: Lisää uusia määräaikojen poikkeamia

source: Add submission deviations
fi: Lisää palautuskertojen poikkeamia

source: List submission deviations
fi: Listaa palautuskertojen poikkeamat

source: Add new submission deviations
fi: Lisää uusia palautuskertojen poikkeamia

source: Remove deadline deviations
fi: Poista määräaikojen poikkeamia

source: Submitter
fi: Palauttaja

source: Extra seconds
fi: Ylimääräiset minuutit

source: Deadline
fi: Määräaika

source: Without late penalty
fi: Ilman myöhästymissakkoa

source: Granter
fi: Myöntäjä

source: Grant time
fi: Myöntämisaika

source: Unknown
fi: Tuntematon

# NUM_OF_EXERCISES -- %(count)s
source: %(count)s assignments
fi: %(count)s tehtävää

source: No deadline deviations.
fi: Ei yhtään määräajan poikkeamaa.

source: Remove submission deviations
fi: Poista palautuskertojen poikkeamia

source: Extra submissions
fi: Ylimääräiset palautuskerrat

source: No submission deviations
fi: Ei palautuskertojen poikkeamia

# SOME_DEVIATIONS_ALREADY_EXISTED_WARNING
source: Some of the deviations already existed. Please select the deviations you want to override.
fi: Jotkin poikkeamat olivat jo olemassa. Valitse ne poikkeamat jotka haluat ylikirjoittaa.

source: Select deviations to be overridden
fi: Valitse ylikirjoitettavat poikkeamat

# OVERRIDE_BEFORE
source: before
fi: ennen

# OVERRIDE_AFTER
source: after
fi: jälkeen

source: Override
fi: Ylikirjoita

source: Submit
fi: Lähetä

# SUCCESS_ADDING_DEVIATIONS
source: Deviations were added succesfully.
fi: Poikkeamat lisättiin onnistuneesti.

# INVALID_EXERCISE_OR_SUBMITTER_ID -- {id}
source: Invalid assignment or submitter id: {id}
fi: Virheellinen tehtävän tai palauttajan id: {id}

# SUCCESS_OVERRIDING_DEVIATIONS
source: Deviations were overriden succesfully.
fi: Poikkeamat ylikirjoitettiin onnistuneesti.

source: Nothing removed.
fi: Mitään ei poistettu.

# REMOVED_DEVIATION -- {count}
source: Removed {count} deviation.
fi: Poistettu {count} poikkeama.

# LABEL_AVAILABILTY
source: availability
fi: saavutettavuus

# LABEL_BODY
source: body
fi: leipäteksti

# LABEL_DATE
source: date
fi: päivämäärä

# LABEL_SIGNATURE_NAME
source: signature name
fi: allekirjoituksen nimi

# LABEL_SIGNATURE_TITLE
source: signature title
fi: allekirjoituksen titteli

# LABEL_SMALL_PRINT
source: small print
fi: pienellä painettu teksti

# LABEL_POINT_LIMITS
source: point limits
fi: pisterajat

# DIPLOMA_POINT_LIMITS_HELPTEXT
source: A list of length 5 where each element is the required points for n:th grade.The element can be a list of 2-tuples [[difficulty_level_a, points], [difficulty_level_b, points]].
fi: Viiden alkion lista, jossa jokainen alkio vastaa vaadittavia pisteitä n:teen arvosanaan. Alkio voi olla lista 2-tupleja, esim. [[difficulty_level_a, points], [difficulty_level_b, points]].

# LABEL_PAD_POINTS
source: pad points
fi: korvaa puuttuvat helpot pisteet vaikeammilla

# DIPLOMA_PAD_POINTS_HELPTEXT
source: If difficulty levels are used, the lower level can be padded with higher level points.
fi: Jos vaikeusasteet ovat käytössä, helpomman tason pisteitä voi korvata vaikeammilla pisteillä.

# LABEL_EXERCISES_TO_PASS
source: assignments to pass
fi: läpäisyyn vaadittavat tehtävät

# LABEL_MODULES_TO_PASS
source: modules to pass
fi: läpäisyyn vaadittavat moduulit

# MODEL_NAME_COURSE_DIPLOMA_DESIGN
source: course diploma design
fi: kurssidiplomin pohja

# MODEL_NAME_COURSE_DIPLOMA_DESIGN_PLURAL
source: course diploma designs
fi: kurssidiplomien pohjat

# LABEL_DESIGN
source: design
fi: pohja

# LABEL_PROFILE
source: user
fi: käyttäjä

# LABEL_CREATED
source: created
fi: luotu

# LABEL_HASHKEY
source: hashkey
fi: tunniste (hashkey)

# LABEL_GRADE
source: grade
fi: arvosana

# MODEL_NAME_STUDENT_DIPLOMA
source: student diploma
fi: opiskelijan diplomi

# MODEL_NAME_STUDENT_DIPLOMA_PLURAL
source: student diplomas
fi: opiskelojoiden diplomit

source: Get course diploma
fi: Lataa kurssidiplomi

source: Open grade 0 diploma
fi: Avaa 0 arvosanan diplomi

source: Filter users
fi: Suodata listaa

source: Username
fi: Käyttäjätunnus

source: Student ID
fi: Opiskelijanumero

# CATEGORY_capitalized
source: Category
fi: Kategoria

source: Hierarchy
fi: Hierarkia

source: Content
fi: Sisältö

source: Reveal model solutions
fi: Malliratkaisun paljastaminen

source: Schedule
fi: Aikataulu

# LABEL_TEACHERS
source: Teachers
fi: Opettajat

# LABEL_ASSISTANTS
source: Assistants
fi: Assistentit

# COURSE_URL_IDENTIFIER_LOCKED_WHILE_COURSE_VISIBLE
source: The URL identifier is locked while the course is visible to students.
fi: URL-osoitteessa käytetty tunniste on lukittu, kun kurssi näkyy opiskelijoille.

# COURSE_REMOVES_MODEL_ANSWER_VISIBILITY_STUDENTS
source: Students will not be able to see model answers after this time.
fi: Tämän jälkeen opiskelijat eivät näe esimerkkiratkaisuja.

# COURSE_REMOVES_SUBMISSION_POSSIBILITY_STUDENTS
source: Students will not be able to submit answers after this time.
fi: Arkistoinnin jälkeen tehtävien palauttaminen ei ole enää mahdollista.

# ERROR_URL_ALREADY_TAKEN
source: The URL is already taken.
fi: URL on jo käytössä.

# COURSE_NEW_URL_IDENTIFIER_COURSE_INSTANCE
source: New URL identifier for the course instance
fi: Uusi URL-osoitteessa käytettävä tunniste kurssikerralle

# COURSE_NEW_URL_IDENTIFIER_COURSE_INSTANCE_HELPTEXT
source: This identifier will be used in the web address for the new course instance.
fi: Tätä tunnistetta käytetään uuden kurssikerran verkko-osoitteessa.

# LABEL_INSTANCE_NAME_HELPTEXT
source: This name will be displayed on the front page below the course name.
fi: Tämä nimi näytetään etusivulla kurssin nimen alapuolella.

# LABEL_TEACHERS_HELPTEXT
source: Copy teachers from this course instance.
fi: Kopioi opettajat tästä kurssikerrasta.

# LABEL_ASSISTANTS_HELPTEXT
source: Copy assistants from this course instance.
fi: Kopioi assistentit tästä kurssikerrasta.

# LABEL_MENU_ITEMS
source: Menu items
fi: Valikon linkit

# LABEL_MENU_ITEMS_HELPTEXT
source: Copy menu items from this course instance.
fi: Kopioi valikon linkit tästä kurssikerrasta.

# LABEL_STUDENT_TAGS
source: Student tags
fi: Opiskelijamerkinnät

# LABEL_STUDENT_TAGS_HELPTEXT
source: Copy student tags from this course instance.
fi: Kopioi opiskelijamerkinnät tästä kurssikerrasta.

# LABEL_SUBMISSION_TAGS
source: Submission tags
fi: Palautusmerkinnät

# LABEL_SUBMISSION_TAGS_HELPTEXT
source: Copy submission tags from this course instance.
fi: Kopioi palautusmerkinnät tästä kurssikerrasta.

# LABEL_YEAR
source: Year
fi: Vuosi

# LABEL_YEAR_HELPTEXT
source: The year on which the course instance starts.
fi: Vuosi, jolloin kurssikerta alkaa.
