Repository: apluslms/a-plus
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi

# SUBMISSION_GRADING_RETRIED -- %(num_retries)s, %(max_retries)s
source: Grading this submission did not finish in time, and it has been retried %(num_retries)s time(s). Retries continue until successful, or until the limit of %(max_retries)s retries is reached.
fi: Palautuksen arvostelu ei valmistunut määräajassa, ja sitä on yritetty uudelleen %(num_retries)s kertaa. Palautusta yritetään automaattisesti enintään %(max_retries)s kertaa.

# PERSONAL_EXTENDED_DEADLINE_PLURAL -- {count}
source: <span data-bs-toggle="tooltip" title="Personal extended deadlines: {count}"><span class="bi-clock" aria-hidden="true"></span><span class="visually-hidden">Personal extended deadlines: {count}</span></span>
fi: <span data-bs-toggle="tooltip" title="Henkilökohtaiset pidennetyt määräajat: {count}"><span class="bi-clock" aria-hidden="true"></span><span class="visually-hidden">Henkilökohtaiset pidennetyt määräajat: {count}</span></span>

source: Latest submissions
fi: Viimeisimmät palautukset

# NO_SUBMISSIONS_FOR_COURSE
source: No submissions for this course.
fi: Ei vielä palautuksia tälle kurssille.

source: Results are currently hidden.
fi: Tulokset on tällä hetkellä piilotettu.

# REQUIRED_EXERCISES_NOT_PASSED
source: Required exercises are not passed
fi: Kaikkia pakollisia tehtäviä ei ole läpäisty

# RESULTS_WILL_BE_REVEALED -- {time}
source: Results will be revealed at the latest on {time}.
fi: Tulokset paljastetaan viimeistään {time}.

source: Excel compatible CSV
fi: Excel-yhteensopiva CSV

source: Best submissions
fi: Parhaat palautukset

source: Incomplete
fi: Keskeneräiset

# REGRADING_PCT -- {percent}
source: Regrading {percent}%
fi: Arvioidaan {percent}%

# REGRADING_PROGRESS -- {current}, {total}
source: Regrading, done {current} / {total}.
fi: Arvioidaan, tehty {current} / {total}.

source: Regrading
fi: Arvioidaan

source: Starting regrade.
fi: Aloitetaan uudelleenarviointi.

# EXERCISE_IN_MAINTENANCE_AND_HIDDEN_FROM_STUDENTS
source: The assignment is in maintenance and the content is hidden from students.
fi: Tehtävässä on huoltokatko, ja sisältö on piilotettu opiskelijoilta.

# EXERCISE_IN_MAINTENTANCE
source: Unfortunately, this assignment is currently under maintenance.
fi: Valitettavasti tässä tehtävässä on juuri nyt huoltokatko.

# SUBMISSION_ERROR_MALFORMED_POST_DATA -- {error}
source: The submission could not be saved due to malformed post data. The submission was not registered. Error: {error}
fi: Palautuksen tallentaminen epäonnistui virheellisen pyynnön takia. Palautusta ei ole huomioitu. Virhe: {error}

source: Your answer was submitted successfully.
fi: Vastauksesi lähetettiin onnistuneesti.

source: Only your last submission will be graded.
fi: Vain viimeinen palautuksesi vaikuttaa tehtävän arvosteluun.

# SUBMISSION_MUST_SIGN_IN_AND_ENROLL_TO_SUBMIT_EXERCISES
source: You need to sign in and enrol to submit exercises.
fi: Palauttaaksesi tehtäviä sinun pitää rekisteröityä ja ilmoittautua kurssin etusivulla.

# DRAFT_WARNING_REMEMBER_TO_SUBMIT
source: This is a draft. Remember to submit your answer for grading!
fi: Tämä on luonnos. Muista lähettää vastauksesi arvosteltavaksi!

# LTI_SERVICE_COURSE_ENROLLMENT_REQUIRED_FOR_ACCESS
source: Course enrolment required for accessing the LTI service.
fi: Kurssille ilmoittautuminen vaaditaan LTI-palveluun pääsemiseksi.

# DESTINATION_INTERNAL_PRIVACY_NOTICE
source: The destination is hosted internally. Link to internal privacy notice.
fi: Määränpää on ylläpidetty sisäisesti. Linkataan sisäiseen tietosuojailmoitukseen.

# DESTINATION_ORGANIZATION_PRIVACY_NOTICE
source: The destination is hosted within the same organization. Link to a privacy notice.
fi: Määränpää on ylläpidetty samassa organisaatiossa Linkataan tietosuojailmoitukseen.

# DESTINATION_EEA_PRIVACY_NOTICE
source: The destination is hosted in the European Economic Area. Link to a privacy notice.
fi: Määränpää on ylläpidetty Euroopan talousalueella. Linkataan tietosuojailmoitukseen.

# DESTINATION_PRIVACYSHIELD_PRIVACY_NOTICE
source: The destination is hosted outside of the European Economic Area and used to be certified under the now invalid EU-US Privacy Shield. Link to an extended privacy notice.
fi: Määränpää on ylläpidetty Euroopan talousalueen ulkopuolella ja se oli aiemmin EU-US Privacy Shield -sertifioitu. Privacy Shield -järjestely on nykyisin kumottu. Linkataan tietosuojailmoitukseen.

# DESTINATION_GLOBAL_PRIVACY_NOTICE
source: The destination is hosted outside of the European Economic Area. Link to an extended privacy notice.
fi: Määränpää on ylläpidetty Euroopan talousalueen ulkopuolella. Linkataan tietosuojailmoitukseen.

# DESTINATION_GLOBAL_GDPR_PRIVACY_NOTICE
source: The destination is hosted outside of the European Economic Area, but is GDPR compliant according to its privacy notice. Link to an extended privacy notice.
fi: Määränpää on ylläpidetty Euroopan talousalueen ulkopuolella, mutta noudattaa GDPR:ää tietosuojailmoituksensa perusteella. Linkataan tietosuojailmoitukseen.

# SERVICE_URL
source: The service URL
fi: Palvelun URL

# LABEL_DESTINATION_REGION
source: destination region
fi: määränpääalue

# SERVICE_DESTINATION_REGION_HELPTEXT
source: The geographical area of the destination. Will display correct user notice.
fi: Määränpään maantieteellinen sijainti. Tämän perusteella näytetään käyttäjälle sopiva ilmoitus.

# LABEL_PRIVACY_NOTICE_URL
source: privacy notice URL
fi: tietosuojailmoituksen URL

# SERVICE_PRIVACY_NOTICE_URL_HELPTEXT
source: A link to the service privacy notice. This is mandatory for services outside the organization!
fi: Linkki palvelun tietosuojailmoitukseen. Tämä on pakollinen palveluille organisaation ulkopuolella!

# LABEL_MENU_LABEL
source: menu label
fi: nimi valikossa

# SERVICE_MENU_LABEL_HELPTEXT
source: A default label to show in the course menu.
fi: Oletusteksti näytettäväksi kurssin valikossa.

# LABEL_MENU_ICON_CLASS
source: menu icon class
fi: ikonin tyyli valikossa

# SERVICE_MENU_ICON_HELPTEXT
source: A default menu icon style name, see http://getbootstrap.com/components/#glyphicons-glyphs
fi: Oletusmenuikonityylin nimi, katso http://getbootstrap.com/components/#glyphicons-glyphs

# LABEL_ENABLED
source: enabled
fi: käytössä

# SERVICE_ENABLED_HELPTEXT
source: If not enabled, the service is disabled for all course instances.
fi: Jos poissa päältä, palvelu on poissa käytöstä kaikissa kurssikerroissa.

# MODEL_NAME_LINK_SERVICE
source: link service
fi: linkattu palvelu

# MODEL_NAME_LINK_SERVICE_PLURAL
source: link services
fi: linkatut palvelut

# SERVICE_ERROR_PRIVACY_NOTICE_URL_MANDATORY
source: The privacy notice URL is mandatory for services outside the organization.
fi: URL tietosuojailmoitukseen on pakollinen organisaation ulkopuolisilla palveluilla.

# LTI_SERVICE_ANONYMOUS_NO_API
source: Anonymous service, no API access
fi: Anonyymi palvelu, ei API-käyttöoikeutta

# LTI_SERVICE_PUBLIC_NO_API
source: Public service, no API access
fi: Julkinen palvelu, ei API-käyttöoikeutta

# LTI_SERVICE_PUBLIC_YES_API
source: Public service, allow API access
fi: Julkinen palvelu, API-käyttöoikeus

# LABEL_ACCESS_SETTINGS
source: access settings
fi: pääsyasetukset

# LTI_SERVICE_ACCESS_SETTINGS_HELPTEXT
source: Select whether to pass pseudonymised user data to the LTI service.<br>Public services can also enable sharing the user's API token and course API URL in the LTI launch request. This grants the LTI tool API access with the user's privileges.
fi: Valitse lähetetäänkö palvelulle pseudonymisoidut käyttäjätiedot.<br>Julkisille palveluille voidaan myös myöntää käyttöoikeus käyttäjän API-avaimeen ja kurssin API-URL:ään.

# LABEL_CONSUMER_KEY
source: consumer key
fi: kuluttaja-avain (consumer key)

# LTI_SERVICE_CONSUMER_KEY_HELPTEXT
source: The consumer key provided by the LTI service.
fi: LTI-palvelun tarjoama kuluttaja-avain.

# LABEL_CONSUMER_SECRET
source: consumer secret
fi: kuluttajasalaisuus (consumer secret)

# LTI_SERVICE_CONSUMER_SECRET_HELPTEXT
source: The consumer secret provided by the LTI service.
fi: LTI-palvelun tarjoama kuluttajasalaisuus.

# MODEL_NAME_LTI_SERVICE
source: LTI service
fi: LTI-palvelu

# MODEL_NAME_LTI_SERVICE_PLURAL
source: LTI services
fi: LTI-palvelut

# MODEL_NAME_LTI1P3_SERVICE
source: LTI v1.3 service
fi: LTI v1.3 - palvelu

# MODEL_NAME_LTI1P3_SERVICE_PLURAL
source: LTI v1.3 services
fi: LTI v1.3 - palvelut

# MENU_ITEM_ACCESS_ALL
source: All students, assistants and teachers can access.
fi: Kaikki opiskelijat, assistentit ja opettajat pääsevät.

# MENU_ITEM_ACCESS_ASSISTANTS_AND_TEACHERS
source: Only assistants and teachers can access.
fi: Vain assistentit ja opettajat pääsevät.

# MENU_ITEM_ACCESS_TEACHERS
source: Only teachers can access.
fi: Vain opettajat pääsevät.

# MENU_ITEM_COURSE_INSTANCE_HELPTEXT
source: A course where the menu item exists.
fi: Kurssi, joka sisältää valikkovaihtoehdon.

# LABEL_ACCESS
source: access
fi: pääsy

# LABEL_SERVICE
source: service
fi: palvelu

# MENU_ITEM_SERVICE_HELPTEXT
source: An external service to link to. These are configured by administrators.
fi: Ulkopuolinen palvelu johon linkataan. Ylläpitäjä määrittelee tässä luetellut palvelut.

# MENU_ITEM_MENU_URL_HELPTEXT
source: A URL that is a) relative to the service URL or b) this course if no service is selected or c) a link to some external website.<br> Case a: A URL starting with '/' overwrites path in service URL and extends it otherwise.<br> Case b: A URL starting with '/' is absolute within this service and relative to the course path otherwise.<br> Case c: A link, for example https://google.com
fi: URL joka on a) suhteellinen palvelun URL:ään tai b) tähän kurssiin, mikäli palvelua ei ole valittu tai c) linkki ulkoiselle sivustolle.<br> Tilanne a: URL, joka alkaa /-merkillä ylikirjoittaa palvelun koko polun, muutoin jatkaa sitä.<br> Tilanne b: URL, joka alkaa /-merkillä on absoluuttinen tämän palvelun suhteen, muutoin on suhteellinen kurssin polkuun.<br> Tilanne c: Linkki, esimerkiksi https://google.com

# LABEL_MENU_GROUP_LABEL
source: menu group label
fi: valikkoryhmän nimi

# MENU_ITEM_MENU_GROUP_LABEL_HELPTEXT
source: Places menu item under a group label.
fi: Sijoittaa linkin annetun väliotsikon alle.

# MENU_ITEM_MENU_LINK_LABEL_HELPTEXT
source: badge for the menu link (else service default).
fi: Nimi (muuten palvelun oletus).

# MENU_ITEM_MENU_ICON_CLASS_HELPTEXT
source: Menu icon style name (else service default), e.g. star see https://icons.getbootstrap.com/
fi: Ikonin tyyli (muuten palvelun oletus), esim. star katso https://icons.getbootstrap.com/

# LABEL_MENU_WEIGHT
source: menu weight
fi: paino valikossa

# MENU_ITEM_MENU_WEIGHT_HELPTEXT
source: Heavier menu entries are placed after lighter ones.
fi: Painavammat linkit sijoittuvat kevyempien jälkeen.

# MODEL_NAME_MENU_ITEM
source: menu item
fi: valikon linkki

# MODEL_NAME_MENU_ITEM_PLURAL
source: menu items
fi: valikkojen linkit

# MENU_ITEM_ERROR_MENU_URL_REQUIRED_WHEN_NO_PRECONFIGURED_SERVICE_SELECTED
source: A relative URL is required when there is no preconfigured service selected.
fi: Suhteellinen URL on pakollinen, kun palvelua ei ole annetussa valikoimassa.

# MENU_ITEM_ERROR_MENU_LABEL_REQUIRED_WHEN_NO_PRECONFIGURED_SERVICE_SELECTED
source: A menu label is required when there is no preconfigured service selected.
fi: Nimi on pakollinen, kun palvelua ei ole annetussa valikoimassa.

# MENU_ITEM_ERROR_SCHEME_IN_MENU_URL_AND_PRECONFIGURED_SERVICE_SELECTED
source: Menu item URL must not begin with a protocol if an external service is selected.
fi: Linkin URL ei saa alkaa protokollalla, jos ulkopuolinen palvelu on valittu.

# MENU_VISIBILTY_PERMISSION_DENIED_MSG
source: Unfortunately, you are not permitted to use this link.
fi: Valitettavasti sinulla ei ole oikeutta käyttää tätä linkkiä.

# MENU_VISIBILITY_ERROR_ONLY_TEACHERS
source: The link is only for teachers.
fi: Tämä linkki on vain opettajille.

# MENU_VISIBILITY_ERROR_ONLY_COURSE_STAFF
source: The link is only for course staff.
fi: Tämä linkki on vain kurssihenkilökunnalle.

# NOT_LTI_SERVICE
source: Not a LTI service
fi: Ei LTI-palvelu

# EXTERNAL_SERVICE_LAUNCH_LEAVING_AND_ENTERING -- %(brand)s, %(name)s
source: You are leaving %(brand)s and entering %(name)s
fi: Olet poistumassa palvelusta %(brand)s ja siirtymässä palveluun %(name)s

# EXTERNAL_SERVICE_LAUNCH_EXERCISE_HOSTED_ON -- %(name)s
source: This assignment is hosted on %(name)s
fi: Tämä tehtävä tulee ulkopuoliselta palvelulta %(name)s

# EXTERNAL_SERVICE_LAUNCH_AUTOMATICALLY_LOAD_EXERCISE_NEXT_TIME
source: Don't show this and automatically load the assignment next time.
fi: Älä näytä tätä ja automaattisesti lataa tehtävä ensikerralla.

# EXTERNAL_SERVICE_LAUNCH_AUTOMATICALLY_OPEN_EXERCISE_NEXT_TIME
source: Don't show this and automatically open the assignment next time.
fi: Älä näytä tätä ja automaattisesti avaa tehtävä ensikerralla.

# EXTERNAL_SERVICE_LAUNCH_AUTOMATICALLY_CONTINUE_TO_SERVICE_NEXT_TIME
source: Don't show this and automatically continue to the service next time.
fi: Älä näytä tätä ja automaattisesti jatka palveluun ensikerralla.

# EXTERNAL_SERVICE_LAUNCH_CHOICE_SAVED_ON_DEVICE_AND_WHERE_TO_REMOVE
source: This choice is saved on your device and you can remove it on your account page.
fi: Tämä valinta tallennetaan laitteellesi ja voit poistaa sen käyttäjätilisivullasi.

# LOAD_THE_EXERCISE
source: Load the assignment
fi: Lataa tehtävä

# OPEN_EXERCISE_IN_NEW_WINDOW
source: Open the assignment in a new window
fi: Avaa tehtävä uudessa ikkunassa

# CONTINUE_TO_SERVICE
source: Continue to the service
fi: Jatka palveluun

source: Show details
fi: Näytä tiedot

# EXTERNAL_SERVICE_NO_PERSONAL_DATA_SENT
source: No personal data is sent to this service.
fi: Mitään henkilötietoja ei lähetetä tähän palveluun.

# EXTERNAL_SERVICE_PSEUDONYMISED_DATA_SENT_TO_SERVICE -- %(brand)s
source: Your name and email address will be pseudonymised and send to the service. This means that the services administration can not identify you, but %(brand)s's administration can if necessary.
fi: Nimesi ja sähköpostiosoitteesi pseudonymisoidaan ja lähetetään palveluun. Tämä tarkoittaa sitä, että palvelun ylläpitäjä ei saa tietoonsa henkilöllisyyttäsi, mutta %(brand)s:n ylläpito pystyy tarvittaessa tunnistamaan sinut palvelussa.

# EXTERNAL_SERVICE_APLUS_ID_SENT_TO_SERVICE
source: Only your A+ user id will be sent to the service. Your name, email address or student ID will not be sent.
fi: Vain A+ -käyttäjätunnuksesi lähetetään tähän palveluun. Nimeäsi, sähköpostiosoitettasi tai opiskelijanumeroasi ei lähetetä.

# EXTERNAL_SERVICE_PERSONAL_DATA_SENT_TO_SERVICE
source: Information including your name and email address will be sent to the service. This means that at least the services administrators can identify you. You can see the full list of information below.
fi: Tietoja kuten nimesi ja sähköpostiosoitteesi lähetetään palveluun, joten vähintään palvelun ylläpitäjä saa tietoonsa henkilöllisyytesi. Voit alta tarkistaa koko listan lähetettävistä tiedoista.

# EXTERNAL_SERVICE_USE_OPTIONAL_BUT_USEFUL
source: We use this external service to help you and other students learn. Nevertheless, you aren't absolutely required to use it in order to pass the course. If you want to avoid using the service, please discuss alternative solutions with the course staff.
fi: Tämän palvelun tarkoitus on parantaa sinun ja muiden opiskelijoiden oppimista. Tästä huolimatta palvelun käyttö ei ole täysin pakollista kurssin suorittamiseksi. Jos haluat välttää palvelun käytön, niin keskustele kurssin henkilökunnan kanssa vaihtoehtoisista ratkaisuista.

# EXTERNAL_SERVICE_SENT_ACCESS_TOKEN_COURSE_STAFF -- %(brand)s
source: Moreover, we send this service a so-called <a href="https://en.wikipedia.org/wiki/Access_token" rel="noopener nofollow" target="_blank" class="alert-link">access token</a>, which gives the service access to the %(brand)s API at your privilege level. If you don't want that to happen, please contact %(brand)s administration.
fi: Lisäksi palvelulle lähetetään <a href="https://en.wikipedia.org/wiki/Access_token" rel="noopener nofollow" target="_blank" class="alert-link">käyttöoikeustietue</a>, joka mahdollistaa palvelun pääsyn %(brand)s:n API:in sinun oikeuksillasi. Mikäli näin ei pitäisi tapahtua, niin ota yhteyttä %(brand)s:n ylläpitoon.

# EXTERNAL_SERVICE_SENT_ACCESS_TOKEN_STUDENT -- %(brand)s
source: Moreover, we send this service a so-called <a href="https://en.wikipedia.org/wiki/Access_token" rel="noopener nofollow" target="_blank" class="alert-link">access token</a>, which gives the service access to the %(brand)s API at your privilege level. This means that the service can, for example, access your student ID number and your progress in the course, and submit solutions to assignments. The course staff has enabled this feature and trust the service to operate with your best interests in mind.
fi: Lisäksi palvelulle lähetetään <a href="https://en.wikipedia.org/wiki/Access_token" rel="noopener nofollow" target="_blank" class="alert-link">käyttöoikeustietue</a>, joka mahdollistaa palvelun pääsyn %(brand)s:n API:in sinun oikeuksillasi. Tämä tarkoittaa sitä, että palvelu voi mm. selvittää opiskelijanumerosi, nähdä kurssisuorituksiasi ja palauttaa tehtäviä puolestasi. Kurssin henkilökunta on mahdollistanut tämän ja luottaa palvelun toimivan etujesi mukaisesti.

# EXTERNAL_SERVICE_PRIVACY_HOSTED_INTERNALLY -- %(brand)s, %(url)s
source: This service is hosted by us (%(brand)s administrators) and thus our <a href="%(url)s" target="_blank">privacy notice</a> covers it too.
fi: Tämä palvelu on meidän ylläpitämämme (%(brand)s), joten meidän <a href="%(url)s" target="_blank">tietosuojailmoituksemme</a> kattaa myös sen.

# EXTERNAL_SERVICE_PRIVACY_HOSTED_IN_ORGANIZATION -- %(brand)s
source: This service is hosted within our organization, but it's not maintained by us (%(brand)s administrators).
fi: Tätä palvelua ylläpitävät eri toimijat samassa organisaatiossa meidän (%(brand)s) kanssamme.

# EXTERNAL_SERVICE_PRIVACY_HOSTED_IN_EEA
source: This service is hosted within the European Economics Area and is thus subject to <a href="https://ec.europa.eu/info/law/law-topic/data-protection/reform_en" rel="noopener nofollow" target="_blank" class="alert-link">the European Union's General Data Protection Regulation</a>.
fi: Tämä palvelu sijaitsee Euroopan talousalueella, joten sitä koskee <a href="https://ec.europa.eu/info/law/law-topic/data-protection/reform_fi" rel="noopener nofollow" target="_blank" class="alert-link">Euroopan unionin yleinen tietosuoja-asetus</a>.

# EXTERNAL_SERVICE_PRIVACY_PRIVACYSHIELD
source: This service is hosted outside of the European Economics Area and is thus not covered by <a href="https://ec.europa.eu/info/law/law-topic/data-protection/reform_en" rel="noopener nofollow" target="_blank" class="alert-link">the European Union's General Data Protection Regulation</a> (GDPR). The service used to be certified under <a href="https://www.privacyshield.gov/Individuals-in-Europe" rel="noopener nofollow" target="_blank" class="alert-link">the EU-U.S. Privacy Shield</a>, but the European Court of Justice has declared the EU-U.S. Privacy Shield invalid. We are investigating how this affects the use of the service.
fi: Tämä palvelu sijaitsee Euroopan talousalueen ulkopuolella, joten sitä ei koske <a href="https://ec.europa.eu/info/law/law-topic/data-protection/reform_fi" rel="noopener nofollow" target="_blank" class="alert-link">Euroopan unionin yleinen tietosuoja-asetus</a> (GDPR). Palvelu oli aiemmin <a href="https://www.privacyshield.gov/Individuals-in-Europe" rel="noopener nofollow" target="_blank" class="alert-link">EU-U.S. Privacy Shield</a> -sertifioitu, mutta Euroopan unionin tuomioistuin on kumonnut päätöksen EU-U.S. Privacy Shield -järjestelyn tietosuojan tason riittävyydestä. Selvitämme edelleen, kuinka uusi päätös vaikuttaa palvelun käyttöön.

# EXTERNAL_SERVICE_PRIVACY_GDPR_COMPLIANT
source: This service is hosted outside the European Economics Area, but is GDPR compliant according to its privacy notice.
fi: Palvelu sijaitsee Euroopan talousalueen ulkopuolella, mutta noudattaa GDPR:ää tietosuojailmoituksensa perusteella.

# EXTERNAL_SERVICE_PRIVACY_GLOBAL
source: This service is not covered by any privacy regulations, thus there isnt any lawful entity to enforce it.
fi: Mikään tietosuoja-asetus ei kata tätä palvelua, joten tietosuojasi ei ole taattu.

# EXTERNAL_SERVICE_PRIVACY_NOTICE -- %(url)s
source: Please see <a href="%(url)s" rel="noopener nofollow" target="_blank" class="alert-link">the service's privacy notice</a> for more details.
fi: Voit katsoa yksityiskohdat palvelun <a href="%(url)s" rel="noopener nofollow" target="_blank" class="alert-link">tietosuojailmoituksesta</a>.

# EXTERNAL_SERVICE_LOOK_WITHOUT_SENDING_DATA -- %(url)s
source: You can first take a look at the external service without sending data: <a href="%(url)s" rel="noopener nofollow" target="_blank">services front page</a>.
fi: Voit vierailla palvelussa lähettämättä tietoja: <a href="%(url)s" rel="noopener nofollow" target="_blank">palvelun etusivu</a>.

source: Add menu item
fi: Lisää linkki

source: Menu items
fi: Valikon linkit

source: Link
fi: Linkki

source: Group
fi: Ryhmä

source: Weight
fi: Paino

source: Service
fi: Palvelu

source: Access
fi: Pääsy

source: Disabled
fi: Poistettu käytöstä

source: Add new menu item
fi: Lisää uusi linkki

# EXTERNAL_SERVICE_MUST_BE_ENROLLED_TO_ACCESS_ANONYMOUS_SERVICE
source: You need to be enrolled to access an anonymous service.
fi: Päästäksesi anonyymiin palveluun, sinun on ilmoittauduttava kurssille.

# ERROR_NUMBER_MUST_BE_BETWEEN_0_AND_1
source: The number must be between 0.0 and 1.0
fi: Numeron on oltava välillä 0.0 - 1.0

# DURATION_UNIT_DAYS
source: days
fi: vuorokaudet

# DURATION_UNIT_HOURS
source: hours
fi: tunnit

# DURATION_UNIT_MINUTES
source: minutes
fi: minuutit

# DURATION_UNIT_SECONDS
source: seconds
fi: sekunnit

# CLIPBOARD_STUDENT_IDS
source: Student IDs
fi: Opiskelijanumerot

# CLIPBOARD_EMAIL_ADDRESSES
source: Email addresses
fi: Sähköpostiosoitteet

# ERROR_ENTER_VALID_JSON
source: Enter valid JSON.
fi: Syötä kelvollista JSON:ia.

# REQUESTED_RESOURCE_NOT_FOUND_FROM_COURSE_SERVICE
source: The requested resource was not found from the course service!
fi: Haettua resurssia ei löytynyt kurssipalvelusta!

# CONNECTING_TO_COURSE_SERVICE_FAILED -- {code}
source: Connecting to the course service failed with {code}!
fi: Yhteys kurssipalveluun epäonnistui virheellä {code}!

# URL_KEY_MAY_CONSIST_OF
source: URL keys may consist of alphanumeric characters, hyphen and period.
fi: URL-avaimet voivat sisältää kirjaimia, numeroita, yhdysmerkin ja pisteen.

# LTI_SELECT_COURSE
source: Select course
fi: Valitse kurssi

# LTI_USE_WHOLE_COURSE
source: Use the whole course
fi: Valitse koko kurssi

# LTI_SELECT_SPECIFIC_CONTENT
source: Select specific content
fi: Valitse tarkempaa sisältöä

# LTI_CONFIRM_USE_WHOLE_COURSE
source: Are you sure you want to use the whole course?
fi: Haluatko varmasti valita koko kurssin?

# LTI_GO_BACK
source: Go back
fi: Takaisin

# LTI_SELECT_CHAPTER_OR_EXERCISE
source: Select chapter or exercise
fi: Valitse luku tai tehtävä

# LTI_SELECT_MODULE
source: Select module
fi: Valitse moduuli

# LTI_USE_WHOLE_MODULE
source: Use the whole module
fi: Valitse koko moduuli

# LTI_TOOL_ERROR_NO_SESSION_OR_LAUNCH_FOUND
source: No LTI launch or session found. You could try to launch the session again from the platform.
fi: LTI-istuntoa ei löytynyt. Yritä käynnistää yhteys uudelleen alustasta.

source: Send email to students
fi: Lähetä sähköpostia opiskelijoille

# SEND_EMAIL_TO_STAFF
source: Send email to course staff
fi: Lähetä sähköpostia kurssihenkilökunnalle

# LABEL_PUBLISH
source: publish
fi: julkaise

# LABEL_PIN
source: pin
fi: kiinnitä listan kärkeen

# MODEL_NAME_NEWS
source: news item
fi: uutinen
