Repository: apluslms/a-plus
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fi

# LABEL_CONTAINER_TYPE
source: object type
fi: objektin tyyppi

# LABEL_CONTAINER_PK
source: object ID
fi: objektin ID

# MODEL_NAME_ABSTRACT_APP
source: abstract app
fi: abstrakti sovellus

# MODEL_NAME_ABSTRACT_APP_PLURAL
source: abstract apps
fi: abstraktit sovellukset

# LABEL_LABEL
source: label
fi: nimi

# TAB_LABEL_HELPTEXT
source: The label is the word displayed on the tab.
fi: Nimi näytetään valintanauhalla välilehden kohdalla.

# LABEL_TITLE
source: title
fi: otsikko

# TAB_TITLE_HELPTEXT
source: The title is displayed on the top of the tab page.
fi: Otsikko näkyy välilehden yläreunassa.

# LABEL_ORDER
source: order
fi: järjestys

# LABEL_OPENING_METHOD
source: opening method
fi: avaamistapa

# TAB_NO_CONTENT
source: No content for this tab...
fi: Ei sisältöä tällä välilehdellä...

# MODEL_NAME_BASE_TAB
source: base tab
fi: perusvälilehti

# MODEL_NAME_BASE_TAB_PLURAL
source: base tabs
fi: perusvälilehdet

# LABEL_CONTENT
source: content
fi: sisältö

# MODEL_NAME_HTML_TAB
source: HTML tab
fi: HTML-välilehti

# MODEL_NAME_HTML_TAB_PLURAL
source: HTML tabs
fi: HTML-välilehdet

# LABEL_CONTENT_URL
source: content URL
fi: sisällön URL

# LABEL_ELEMENT_ID
source: element ID
fi: elementin ID

# MODEL_NAME_EXTERNAL_EMBEDDED_TAB
source: external embedded tab
fi: ulkoinen upotettu välilehti

# MODEL_NAME_EXTERNAL_EMBEDDED_TAB_PLURAL
source: external embedded tabs
fi: ulkoiset upotetut välilehdet

# LABEL_WIDTH
source: width
fi: leveys

# LABEL_HEIGHT
source: height
fi: korkeus

# MODEL_NAME_EXTERNAL_IFRAME_TAB
source: external iframe tab
fi: ulkoinen iframe-välilehti

# MODEL_NAME_EXTERNAL_IFRAME_TAB_PLURAL
source: external iframe tabs
fi: ulkoiset iframe-välilehdet

# LABEL_VIEWS
source: views
fi: näkymät

# BASE_PLUGIN_MISSING_RENDER-METHOD
source: Base plug-in does not have a render-method.
fi: Perusliitännäisellä ei ole renderöi-metodia.

# MODEL_NAME_BASE_PLUGIN
source: base plug-in
fi: perusliitännäinen

# MODEL_NAME_BASE_PLUGIN_PLURAL
source: base plug-ins
fi: perusliitännäiset

# LABEL_FEED_URL
source: feed URLs
fi: syötteen URL

# MODEL_NAME_RSS_PLUGIN
source: RSS plug-in
fi: RSS-liitännäinen

# MODEL_NAME_RSS_PLUGIN_PLURAL
source: RSS plug-ins
fi: RSS-liitännäiset

# MODEL_NAME_HTML_PLUGIN
source: HTML plug-in
fi: HTML-liitännäinen

# MODEL_NAME_HTML_PLUGIN_PLURAL
source: HTML plug-ins
fi: HTML-liitännäiset

# LABEL_SERVICE_URL
source: service URL
fi: palvelun URL

# MODEL_NAME_EXTERNAL_IFRAME_PLUGIN
source: external iframe plug-in
fi: ulkoinen iframe-liitännäinen

# MODEL_NAME_EXTERNAL_IFRAME_PLUGIN_PLURAL
source: external iframe plug-ins
fi: ulkoiset iframe-liitännäiset

# NO_JWT_PERMISSION -- {permission}, {type}, {kwargs}
source: No {permission} access to {type} with {kwargs}
fi: Ei {permission} oikeutta tyyppiin {type}, jolla {kwargs}

# ACCESS_ANYONE
source: Any user authenticated or not
fi: Kuka tahansa kirjautunut tai kirjautumaton käyttäjä

# ACCESS_ANY_STUDENT
source: Any authenticated student
fi: Kuka tahansa kirjautunut käyttäjä

# ACCESS_ENROLLED_STUDENT
source: An enrolled student of the course
fi: Kurssille ilmoittautunut opiskelija

# ACCESS_COURSE_ASSISTANT
source: An assistant of the course
fi: Kurssin assistentti tai opettaja

# ACCESS_GRADING
source: A member of the course staff with grading rights. An assistant (if allowed) or a teacher
fi: Kurssihenkilökunnan jäsen, jolla on arvosteluoikeudet. Assistentti (jos sallittu) tai opettaja

# ACCESS_TEACHER
source: A teacher of the course
fi: Kurssin opettaja

# ACCESS_SUPERUSER
source: A superuser of the service
fi: Palvelun hallintokäyttäjä

# ACCESS_PERMISSION_DENIED_MSG
source: Unfortunately, you are not permitted to view this content.
fi: Valitettavasti sinulla ei ole oikeutta nähdä tätä sisältöä.

# ACCESS_ERROR_ONLY_AUTHENTICATED
source: Please login.
fi: Kirjaudu sisään.

# ACCESS_ERROR_ONLY_TEACHERS
source: Only course teachers are permitted.
fi: Vain opettajille.

# ACCESS_ERROR_ONLY_COURSE_STAFF
source: Only course staff is permitted.
fi: Vain kurssihenkilökunnalle.

# ACCESS_ERROR_ONLY_ENROLLED_STUDENTS
source: Only enrolled students are permitted.
fi: Vain ilmoittautuneille.

# LABEL_MEMBERS
source: Members
fi: Jäsenet

# COURSE_CONFIG_ERROR -- {error!s}
source: Course configuration failed with error '{error!s}'. Configuration of course aborted.
fi: Kurssin sisältöasetusten päivitys epäonnistui virheellä '{error!s}'. Asetusten päivitys keskeytettiin.

# COURSE_UPDATE_WARNINGS_SUBJECT -- {instance}
source: {instance} - warnings about course update
fi: {instance} - kurssipäivityksen varoitukset

# COURSE_UPDATE_ERRORS_SUBJECT -- {instance}
source: {instance} - course update failed
fi: {instance} - kurssipäivitys epäonnistui

# ERROR_EMAIL_FAILED
source: Failed to send error email
fi: Virhesähköpostin lähetys epäonnistui

# SEND_EMAIL_FAILED
source: Failed to send email
fi: Sähköpostin lähetys epäonnistui

# GROUP_MEMBER_LABEL -- {num}
source: {num} member
fi: {num} jäsen

# ERROR_CODE_NOT_RECOGNIZED
source: The code was not recognized.
fi: Liittymiskoodia ei tunnistettu.

# ERROR_USER_ALREADY_IN_GROUP
source: The user is already in the group.
fi: Käyttäjä on jo tässä ryhmässä.

# ERROR_GROUP_ALREADY_EXISTS
source: The group already exists.
fi: Tämä ryhmä on jo olemassa.

# MUST_HAVE_TWO_MEMBERS
source: A group must have at least two members
fi: Ryhmässä tulee olla vähintään kaksi jäsentä

# LABEL_USERS
source: Users
fi: Käyttäjät

# LABEL_ENROLL_FROM_SIS
source: Enrol participants from Student Information System
fi: Lisää osallistujia opintotietojärjestelmästä

# LABEL_NAME
source: Name
fi: Nimi

# LABEL_CODE
source: code
fi: koodi

# COURSE_URL_IDENTIFIER_HELPTEXT
source: Input an URL identifier for this course.
fi: Syötä URL-osoitteessa käytettävä tunnus kurssille.

# MODEL_NAME_COURSE
source: course
fi: kurssi

# MODEL_NAME_COURSE_PLURAL
source: courses
fi: kurssit

# TAKEN_WORDS_INCLUDE -- {}
source: Reserved words include: {}
fi: Varatut sanat: {}

# LABEL_COURSE_INSTANCE
source: course instance
fi: kurssikerta

# LABEL_TIMESTAMP
source: timestamp
fi: aikaleima

# MODEL_NAME_STUDENT_GROUP
source: student group
fi: opiskelijaryhmä

# MODEL_NAME_STUDENT_GROUP_PLURAL
source: student groups
fi: opiskelijaryhmät

source: Student
fi: Opiskelija

source: Assistant
fi: Assistentti

source: Teacher
fi: Opettaja

source: Active
fi: Aktiivinen

source: Removed
fi: Poistettu

source: Banned
fi: Estetty

source: Pending
fi: Odottava

# LABEL_USER_PROFILE
source: user
fi: käyttäjä

# LABEL_LANGUAGE
source: language
fi: kieli

# LABEL_PERSONAL_CODE
source: personal code
fi: henkilökohtainen koodi

# LABEL_SELECTED_GROUP
source: selected group
fi: valittu ryhmä

# LABEL_ANON_NAME
source: anonymized name
fi: anonymisoitu nimi

# LABEL_ANON_ID
source: anonymized ID
fi: anonymisoitu ID

# LABEL_ROLE
source: role
fi: rooli

# LABEL_STATUS
source: status
fi: tila

# LABEL_FROM_SIS
source: from SIS
fi: opintotietojärjestelmästä

# MODEL_NAME_ENROLLMENT
source: enrolment
fi: ilmoittautuminen

# MODEL_NAME_ENROLLMENT_PLURAL
source: enrolments
fi: ilmoittautumiset

# LABEL_VISIBLE_TO_STUDENTS
source: visible to students
fi: näkyy opiskelijoille

# MODEL_NAME_USER_TAG
source: user tag
fi: käyttäjämerkintä

# MODEL_NAME_USER_TAG_PLURAL
source: user tags
fi: käyttäjämerkinnät

# MODEL_NAME_SUBMISSION_TAG
source: submission tag
fi: palautusmerkintä

# MODEL_NAME_SUBMISSION_TAG_PLURAL
source: submission tags
fi: palautusmerkinnät

# MODEL_NAME_HARDCODED_USER_TAG
source: hardcoded user tag
fi: kovakoodattu käyttäjämerkintä

# MODEL_NAME_HARDCODED_USER_TAG_PLURAL
source: hardcoded user tags
fi: kovakoodatut käyttäjämerkinnät

source: internal
fi: sisäinen

# INTERNAL_USER_DESCRIPTION
source: The user has the local organization listed as their organization.
fi: Käyttäjän organisaationa on paikallinen organisaatio.

source: external
fi: ulkopuolinen

# EXTERNAL_USER_DESCRIPTION
source: The user does not have the local organisation listed as their organization. The user has logged in through external authentication.
fi: Käyttäjän organisaationa ei ole paikallista organisaatiota, joten hän on kirjautunut sisään jonkin toisen tunnistuspalvelun kautta.

# LABEL_TAG
source: tag
fi: merkintä

# LABEL_USER
source: user
fi: käyttäjä

# MODEL_NAME_USER_TAGGING
source: user tagging
fi: käyttäjän merkintä

# MODEL_NAME_USER_TAGGING_PLURAL
source: user taggings
fi: käyttäjien merkinnät

source: Internal users
fi: Oppilaitoksen sisäiset käyttäjät

source: External users
fi: Oppilaitoksen ulkopuoliset käyttäjät

# ALL_USERS
source: Internal and external users
fi: Oppilaitoksen sisäiset ja ulkopuoliset käyttäjät

source: Enrolled students
fi: Ilmoittautuneet opiskelijat

# ENROLLMENT_AUDIENCE
source: Enrolment audience
fi: Ilmoittautumisen kohdeyleisö

source: All registered users
fi: Kaikki rekisteröityneet käyttäjät

# PUBLIC
source: Public to the internet
fi: Julkisesti internetissä

source: User results
fi: Pistetilanne

source: Table of contents
fi: Sisällysluettelo

# LAST_VISITED_LINK
source: Link to last visited content
fi: Linkki viimeksi vierailtuun sisältöön

# EXPERIMENTAL_SETUP
source: Experimental setup (hard-coded)
fi: Koeasetelma (kovakoodattu)

# NUMBERING_NONE
source: No numbering
fi: Ei numerointia

# NUMBERING_ARABIC
source: Arabic
fi: arabialainen

# NUMBERING_ROMAN
source: Roman
fi: roomalainen

# NUMBERING_HIDDEN_ARABIC
source: Hidden arabic
fi: piilotettu arabialainen

# LABEL_COURSE
source: course
fi: kurssi

# LABEL_INSTANCE_NAME
source: Instance name
fi: Kurssikerran nimi

# COURSE_INSTANCE_URL_IDENTIFIER_HELPTEXT
source: Input an URL identifier for this course instance.
fi: Syötä URL-osoitteessa käytettävä tunnus kurssikerralle.

# LABEL_GROUP_WORK_ALLOWED
source: students can form groups
fi: opiskelijat saavat luoda ryhmiä

# LABEL_ENROLLMENT_AUDIENCE
source: enrolment audience
fi: ilmoittautumisen kohdeyleisö

# LABEL_VIEW_CONTENT_TO
source: content visibility
fi: sisällön näkyvyys

# LABEL_STARTING_TIME
source: starting time
fi: alkamisaika

# LABEL_ENDING_TIME
source: ending time
fi: päättymisaika

# LABEL_LIFESUPPORT_TIME
source: lifesupport time
fi: saattohoitoaika

# LABEL_ARCHIVE_TIME
source: archival time
fi: arkistointiaika

# LABEL_ENROLLMENT_STARTING_TIME
source: enrolment starting time
fi: ilmoittautumisen avautumisaika

# COURSE_INSTANCE_ENROLLMENT_TIME_HELPTEXT
source: This setting does not affect students from the local organization when enrolment is handled through SIS.
fi: Tämä asetus ei vaikuta paikallisiin opiskelijoihin, kun ilmoittautuminen tehdään opintotietojärjestelmän kautta.

# LABEL_ENROLLMENT_ENDING_TIME
source: enrolment ending time
fi: ilmoittautumisen päättymisaika

# LABEL_IMAGE
source: image
fi: kuva

# LABEL_DESCRIPTION
source: Description
fi: Kuvaus

# LABEL_FOOTER
source: footer
fi: alapalkki

# LABEL_INDEX_MODE
source: course front page
fi: kurssin etusivu

# COURSE_INSTANCE_INDEX_CONTENT_SELECTION_HELPTEXT
source: Select content for the course front page.
fi: Valitse sisältö kurssin etusivulle.

# LABEL_MODULE_NUMBERING
source: module numbering
fi: moduulien numerointi

# LABEL_CONTENT_NUMBERING
source: content numbering
fi: sisällön numerointi

# LABEL_HEAD_URLS
source: head URLs
fi: head-elementtiin sisällytettävät URL:t

# COURSE_INSTANCE_EXTERNAL_CSS_AND_JS_FOR_ALL_PAGES_HELPTEXT
source: External CSS and JS resources that are included on all course pages. Separate with whitespace.
fi: Ulkoiset CSS- ja JS-resurssit, jotka sisällytetään kurssisivuihin. Erottele osoitteet rivinvaihdoilla.

# LABEL_TECHNICAL_ERROR_EMAILS
source: technical error emails
fi: teknisten virheiden ilmoitusten vastaanottajat

# COURSE_INSTANCE_EXERCISE_ERROR_EMAIL_RECIPIENT_OVERRIDE_HELPTEXT
source: By default assignment errors are reported to teacher email addresses. List emails here separated by commas to override the default recipients.
fi: Tehtävien tekniset virheet ilmoitetaan oletusarvoisesti kurssin opettajien sähköposteihin. Syötä pilkuilla erotettuja sähköpostiosoitteita korvaamaan oletusvastaanottajat.

# LABEL_SIS_IDENTIFIER
source: Course identifier in the student info system
fi: Opintotietojärjestelmän kurssin tunniste

# LABEL_SIS_ENROLL
source: Enrol from SIS
fi: Ilmoittautumiset opintotietojärjestelmästä

# COURSE_INSTANCE_SIS_ENROLL_HELP
source: When enabled, students from local organization must enrol through SIS.
fi: Kun valittu, paikallisten opiskelijoiden on ilmoittauduttava opintotietojärjestelmän kautta.

# LABEL_POINTS_GOAL_ENABLED
source: Enable personalized points goal feature
fi: Ota käyttöön henkilökohtainen pistetavoite -ominaisuus

# LABEL_POINTS_GOAL_ENABLED_HELP
source: When enabled, students will be able to specify their own points goals for modules. This only affects the visual of the points progress bar for students and does not affect grading.
fi: Kun tämä on käytössä, opiskelijat voivat määrittää omat pistetavoitteensa moduuleille. Tämä vaikuttaa vain opiskelijoiden pistepalkin ulkonäköön, eikä vaikuta arviointiin.

# MODEL_NAME_COURSE_INSTANCE
source: course instance
fi: kurssikerta

# MODEL_NAME_COURSE_INSTANCE_PLURAL
source: course instances
fi: kurssikerrat

# COURSE_INSTANCE_ERROR_INSTANCE_NAME -- {}
source: You cannot use the word '{}' as an instance name.
fi: Et voi käyttää sanaa {} kurssikerran nimenä.

# COURSE_INSTANCE_ERROR_URL -- {}
source: You cannot use the word '{}' in the URL.
fi: Et voi käyttää sanaa {} URL-osoitteessa.

# COURSE_INSTANCE_ERROR_ENDING_TIME_BEFORE_STARTING
source: The ending time must be later than the starting time.
fi: Päättymisajan tulee olla alkamisajan jälkeen.

# COURSE_INSTANCE_ERROR_LIFESUPPORT_TIME_BEFORE_ENDING
source: The lifesupport time must be later than the ending time.
fi: Saattohoitoajan tulee alkaa päättymisajan jälkeen.

# COURSE_INSTANCE_ERROR_ARCHIVE_TIME_AND_LIFESUPPORT_ONLY_ONE_SET
source: Lifesupport time and archival time must be either both set or both unset.
fi: Saattohoitoaika ja arkistointiaika pitää molemmat asettaa tai muutoin kumpaakaan ei voi asettaa.

# COURSE_INSTANCE_ERROR_ARCHIVE_TIME_BEFORE_LIFESUPPORT
source: The archival time must be later than the lifesupport time.
fi: Arkistointiajan tulee olla saattohoidon jälkeen.

# COURSE_INSTANCE_ERROR_LANGUAGE(S)_MISSING_FROM_SETTINGS
source: Language code(s) missing from settings:
fi: Palvelun asetuksista puuttuva(t) kielikoodi(t):

# COURSE_INSTANCE_ERROR_LANGUAGE_MISSING_FROM_SETTINGS
source: Language code missing from settings.
fi: Kielikoodi puuttuu palvelun asetuksista.

# LABEL_HOOK_URL
source: hook URL
fi: koukun URL

# LABEL_HOOK_TYPE
source: hook type
fi: koukun tyyppi

# MODEL_NAME_COURSE_HOOK
source: course hook
fi: kurssikoukku

# MODEL_NAME_COURSE_HOOK_PLURAL
source: course hooks
fi: kurssikoukut

# STATUS_READY
source: Ready
fi: Valmis

# STATUS_UNLISTED
source: Unlisted in table of contents
fi: Näkymätön sisällysluettelossa

# STATUS_HIDDEN
source: Hidden
fi: Piilotettu

# STATUS_MAINTENANCE
source: Maintenance
fi: Huolto

# MODULE_URL_IDENTIFIER_HELPTEXT
source: Input an URL identifier for this module.
fi: Syötä URL-osoitteessa käytettävä tunnus moduulille.

# LABEL_POINTS_TO_PASS
source: points to pass
fi: läpäisyyn vaadittavat pisteet

# LABEL_INTRODUCTION
source: introduction
fi: johdanto

# LABEL_READING_OPENING_TIME
source: opening time for the reading material
fi: lukumateriaalin avautumisaika

# MODULE_READING_OPENING_TIME_HELPTEXT
source: Leave empty if the reading material should not open before the assignments.
fi: Jätä tyhjäksi, jos lukumateriaalin ei pidä aueta ennen tehtäviä.

# LABEL_EXERCISE_OPENING_TIME
source: opening time for the assignments
fi: tehtävien avautumisaika

# LABEL_CLOSING_TIME
source: closing time
fi: sulkeutumisaika

# MODULE_CLOSING_TIME_HELPTEXT
source: The default closing time of the assignments in this module.
fi: Tätä aikaa käytetään oletuksena moduulin tehtävien määräajoille.

# LABEL_LATE_SUBMISSIONS_ALLOWED
source: late submissions allowed
fi: salli myöhästyneet palautukset

# LABEL_LATE_SUBMISSION_DEADLINE
source: late submission deadline
fi: myöhästyneiden palautusten määräaika

# LABEL_LATE_SUBMISSION_PENALTY
source: late submission penalty
fi: myöhästymissakko

# MODULE_LATE_SUBMISSION_PENALTY_HELPTEXT
source: Multiplier of points to reduce as a decimal (e.g. 0.1 = 10%).
fi: Pisteiden vähennyskerroin desimaalilukuna, esim. 0,1 = 10%

# LABEL_MODEL_ANSWER
source: model answer
fi: esimerkkiratkaisu

# LABEL_MODEL_SOLUTION_REVEAL_RULE
source: Model solution reveal rule
fi: malliratkaisun paljastamissääntö

# MODEL_NAME_COURSE_MODULE
source: course module
fi: kurssimoduuli

# MODEL_NAME_COURSE_MODULE_PLURAL
source: course modules
fi: kurssimoduulit

# MODULE_ERROR_OPENING_TIME_AFTER_CLOSING_TIME
source: The opening time must be earlier than the closing time.
fi: Avautumisajan tulee olla aikaisempi kuin sulkeutumisaika.

# MODULE_ERROR_LATE_SUBMISSION_DL_BEFORE_CLOSING_TIME
source: The late submission deadline must be later than the closing time.
fi: Myöhäisten palautusten määräajan tulee olla myöhäisempi kuin sulkeutumisajan.

# MODULE_ERROR_READING_OPENING_TIME_AFTER_EXERCISE_OPENING
source: The opening time of reading material must be earlier than the opening time of the assignments.
fi: Lukumateriaalin tulee aueta ennen tehtäviä.

# MODULE_ERROR_MODEL_ANSWER_CHAPTER_IN_DIFFERENT_COURSE
source: The model solution chapter must belong to the same course instance as the course module.
fi: Moduulin esimerkkiratkaisuja esittelevän luvun täytyy kuulua samaan kurssikertaan kuin moduuli itse.

# STATUS_NO_TOTAL_POINTS
source: No total points
fi: Ei yhteispisteitä

# LABEL_CONFIRM_THE_LEVEL
source: mandatory activity
fi: pakollinen osio

# LEARNING_OBJECT_CATEGORY_LEVEL_CONFIRMATION_EXERCISE_HELPTEXT
source: Students must get over zero points in an activity of this category before their other points in the same chapter/module become confirmed. Suggested usage: check this box for feedback activities that students must fill to receive points for a course component.
fi: Opiskelijan täytyy saada yli nolla pistettä, jotta saman luvun/moduulin muiden tehtävien pisteet vahvistetaan. Suositeltu käyttötapa: käytä ominaisuutta palautteessa, johon opiskelijoiden täytyy vastata, jotta he saavat pisteet kurssin luvusta/moduulista.

# LABEL_ACCEPT_UNOFFICIAL_SUBMITS
source: accept unofficial submissions
fi: salli epäviralliset palautukset

# LEARNING_OBJECT_CATEGORY_ACCEPT_UNOFFICIAL_SUBMISSIONS_HELPTEXT
source: Accept unofficial submissions after deadlines have passed or submission limits have been exceeded. These are graded and the feedback is displayed to the student. The points are stored but not included in official records.
fi: Salli epävirallisia palautuksia tehtävän sulkeuduttua tai kun palautuskertojen enimmäismäärä on ylitetty. Nämä arvostellaan ja palaute näytetään opiskelijalle. Pisteet tallennetaan, mutta niitä ei huomioida virallisissa tuloksissa.

# MODEL_NAME_LEARNING_OBJECT_CATEGORY
source: learning object category
fi: oppimissisältökategoria

# MODEL_NAME_LEARNING_OBJECT_CATEGORY_PLURAL
source: learning object categories
fi: oppimissisältökategoriat

# NO_JWT_COURSE_PERMISSION
source: No permission to access course
fi: Ei oikeutta kurssiin

# NO_JWT_INSTANCE_PERMISSION
source: No permission to access course instance
fi: Ei oikeutta kurssikertaan

# NO_JWT_EXERCISE_PERMISSION
source: No permission to access exercise
fi: Ei oikeutta tehtävään

# NO_JWT_SUBMISSION_PERMISSION
source: No permission to access submission
fi: Ei oikeutta palautukseen

# COURSE_VISIBILITY_PERMISSION_DENIED_MSG
source: Unfortunately, you are not permitted to view this course.
fi: Valitettavasti sinulla ei ole oikeutta nähdä tätä kurssia.

# COURSE_VISIBILITY_ERROR_NOT_VISIBLE
source: The resource is not currently visible.
fi: Materiaali ei ole tällä hetkellä nähtävissä.

# COURSE_VISIBILITY_ERROR_NOT_PUBLIC
source: This course is not open for public.
fi: Tälle kurssille ei ole vapaata pääsyä.

# COURSE_ENROLLMENT_AUDIENCE_ERROR_ONLY_INTERNAL -- {institution}
source: This course is only for students within {institution} ("internal users").
fi: Tämä kurssi on vain oppilaitoksen {institution} opiskelijoille (eli sisäisille käyttäjille).

# COURSE_ENROLLMENT_AUDIENCE_ERROR_ONLY_EXTERNAL -- {institution}
source: This course is only for students outside {institution} ("external users").
fi: Tämä kurssi on vain oppilaitoksen {institution} ulkopuolisille käyttäjille (eli ulkopuolisille käyttäjille).

# MODULE_PERMISSION_MSG_NOT_VISIBLE
source: The module is not currently visible.
fi: Tämä moduuli ei ole tällä hetkellä nähtävissä.

# MODULE_PERMISSION_ERROR_NOT_OPEN_YET -- {date}
source: The module will open for submissions at {date}.
fi: Tämä moduuli avautuu {date}.

# COURSE_PERMISSION_MSG_ONLY_TEACHER
source: Only course teacher is allowed
fi: Vain opettajalle.

# COURSE_PERMISSION_MSG_ONLY_COURSE_STAFF
source: Only course staff is allowed
fi: Vain kurssihenkilökunnalle.

# COURSE_PERMISSION_MSG_ONLY_ENROLLED_STUDENTS_OR_COURSE_STAFF
source: Only enrolled students or course staff are allowed
fi: Vain ilmoittautuneille opiskelijoille tai kurssihenkilökunnalle

# SUCCESS_SAVING_CHANGES
source: Changes were saved succesfully.
fi: Muutokset tallennettiin onnistuneesti.

# FAILURE_SAVING_CHANGES
source: Failed to save changes.
fi: Muutosten tallentaminen epäonnistui.

# STUDENT_ENROLLED_FROM_SIS -- {addcount}
source: {addcount} student has been enrolled based on SIS.
fi: {addcount} opiskelija on lisätty opintotietojärjestelmästä.

# STUDENT_REMOVED_FROM_SIS -- {delcount}
source: {delcount} student has been removed based on SIS.
fi: {delcount} opiskelija on poistettu opintotietojärjestelmästä.

# COULD_NOT_ACCESS_SIS
source: Could not access SIS enrollments.
fi: Ilmoittautumisia ei voitu hakea opintotietojärjestelmästä.

# ENROLLMENTS_FAILED_WARNING_USERS_ALREADY_ENROLLED -- {users}
source: The following users were already enrolled: {users}
fi: Seuraavat käyttäjät olivat jo ilmoittautuneet: {users}

# ENROLLMENTS_FAILED_WARNING_COURSE_STAFF -- {users}
source: The following users are course staff and cannot be enrolled as students: {users}
fi: Seuraavat käyttäjät ovat kurssin henkilökuntaa, eivätkä voi ilmoittautua opiskelijoiksi: {users}

source: Hidden from students
fi: Piilotettu opiskelijoilta

# COURSE_DROPDOWN_EMPTY_TEXT
source: Begin by enrolling in a course.
fi: Aloita ilmoittautumalla jollekin kurssille.

source: Skip course navigation
fi: Ohita kurssivalikko

source: Course
fi: Kurssi

source: Minimise sidebar
fi: Pienennä sivupalkki

source: Change language
fi: Vaihda kieli

source: Language
fi: Kieli

source: Course materials
fi: Kurssimateriaali

# EXERCISE_RESULTS
source: Your points
fi: Omat pisteesi

source: Form a group
fi: Luo uusi ryhmä

source: Apps
fi: Sovellukset

source: Course staff
fi: Kurssihenkilökunta

source: Participants
fi: Opiskelijat

source: Groups
fi: Ryhmät

source: Grades
fi: Arvosanat

source: All results
fi: Kaikki pisteet

source: Visualizations
fi: Visualisoinnit

# UNPSEUDONYMIZE
source: Depseudonymize
fi: Pseudonymisointi pois päältä

source: Pseudonymize
fi: Pseudonymisointi päälle

source: Edit news
fi: Muokkaa kurssiuutisia

source: Edit course
fi: Muokkaa kurssia

source: Deadline deviations
fi: Määräaikojen poikkeamat

source: Submission deviations
fi: Palautuskertojen poikkeamat

source: All submissions
fi: Kaikki palautukset

# ENROLL_THROUGH_SIS
source: You must enrol on this course through Student Information System. If you registered just now, note that there is a delay before new enrolments become active. Enrolments are fetched from SIS typically once an hour.
fi: Sinun täytyy ilmoittautua tälle kurssille opintotietojärjestelmässä. Jos rekisteröidyit juuri äskettäin, huomaa, että uudet ilmoittautumiset aktivoituvat viiveellä. Ilmoittautumiset haetaan opintotietojärjestelmästä tyypillisesti kerran tunnissa.
