{
  "No matches!":
  "Ei osumia!",

  " results more":
  " osumaa lisää",

  "Toggle filtering by tag":
  "Suodata merkinnällä",

  "Remove tagging":
  "Poista merkintä",

  "Add new tagging":
  "Lisää merkintä",

  "Comparison operators >, <, >=, <=, !=, == are available — e.g. >=200. Datetime comparison is available in format yyyy-mm-dd hh:mm — e.g. >=0918-09-20 15:00. Regex is available — e.g. /^\\d+$/g. Use dot as decimal seperator — e.g. 2.1.":
  "Vertailuoperaattorit >, <, >=, <=, !=, == ovat käytettävissä, esimerkiksi >=200. Ajan vertailu on mahdollista muodossa yyyy-mm-dd hh:mm, esimerkiksi >=0918-09-20 15:00. Regex on myös käytettävissä, esimerkiksi /^\\d+$/g. Käytä desimaalierottimena pistettä, esimerkiksi 2.1.",

  "There might be something wrong with the filter. Some comparison operators only accept numbers. If you are using datetime, make sure the format is correct. If you are using regex, make sure it is correct.":
  "Suodattimissa voi olla virhe. Jotkut vertailuoperaattorit hyväksyvät vain numeroita. Mikäli vertailet aikaa, varmista että formaatti on oikea. Mikäli käytät regexiä, niin varmista että se on oikein.",

  "Filter":
  "Suodatus",

  "Reset filters":
  "Nollaa suodattimet",

  "Collapse":
  "Supista",

  "Expand":
  "Laajenna",

  "Total":
  "Yhteensä",

  "Tags":
  "Merkinnät",

  "Student name":
  "Opiskelijan nimi",

  "First name":
  "Etunimi",

  "Last name":
  "Sukunimi",

  "Email":
  "Sähköposti",

  "Status":
  "Tila",

  "Organization":
  "Organisaatio",

  "Student ID":
  "Opiskelija­numero",

  " students selected":
  " opiskelijaa valittuna",

  "No difficulty":
  "Ei vaikeusastetta",

  "The percentage indicates the distribution of the total.":
  "Prosenttiosuus ilmaisee osuuden kokonaissummasta.",

  "Total submissions":
  "Palautuksia yhteensä",

  "Average submissions per student with submissions":
  "Palautusten keskiarvo per opiskelija, jolla on vähintään yksi palautus",

  "Maximum submissions":
  "Palautusmahdollisuuksia",

  "Students with submissions":
  "Tehtävän palauttaneet opiskelijat",

  "Students with max points":
  "Opiskelijoiden lkm, joilla on täydet pisteet",

  "Average points per student with submissions":
  "Pisteiden keskiarvo per opiskelija, jolla on vähintään yksi palautus",

  "Maximum points":
  "Enimmäispisteet",

  "Total number of submissions. Calculates all student submission counts together.":
  "Palautusten lukumäärä. Laskee kaikkien opiskelijoiden kaikkien palautusten lukumäärän yhteen.",

  "How many submissions a single student has used on the assignment or group of assignments on average. Only accounts for students with one or more submissions.":
  "Kuinka monta palautusta opiskelija on käyttänyt tehtävään tai tehtäväjoukkoon keskimäärin. Lasketaan vain opiskelijat, joilla on vähintään yksi palautus.",

  "Maximum number of available submissions for the assignment or group of assignments.":
  "Kuinka monta palautusta tehtävässä tai tehtäväjoukossa on mahdollista käyttää.",

  "Number of students that have one or more assignment submissions.":
  "Opiskelijoiden lukumäärä, joilla on vähintään yksi palautus.",

  "Number of students that have received maximum points from the assignment or group of assignments.":
  "Opiskelijoiden lukumäärä, jotka ovat saaneet täydet pisteet tehtävästä tai tehtäväjoukosta.",

  "Average points received for the assignment or group of assignments. Only accounts for students with one or more submissions.":
  "Kuinka monta pistettä opiskelijat ovat saaneet tehtävästä tai tehtäväjoukosta keskimäärin. Lasketaan vain opiskelijat, joilla on vähintään yksi palautus.",

  "Maximum points for the assignment or group of assignments.":
  "Tehtävän tai tehtäväjoukon enimmäispisteet.",

  "Export to xlsx (Excel)":
  "Vie xlsx tiedostoon (Excel)",

  "Export to csv (LibreOffice)":
  "Vie csv tiedostoon (LibreOffice)",

  "Export to txt":
  "Vie txt tiedostoon",

  "None selected":
  "Nolla valintaa",

  "All selected":
  "Kaikki valittu",

  "selected":
  "valittu",

  "Select all":
  "Valitse kaikki",

  "student_results":
  "opiskelijoiden_tulokset",

  "Some students have unofficial points that are greater than zero. However, they are calculated as zero in the table until they are confirmed. This may be caused for example by missing feedback form.":
  "Osalla opiskelijoista on epävirallisia pisteitä, jotka ovat enemmän kuin nolla. Nämä pisteet on silti laskettu nollana taulukossa, kunnes ne on vahvistettu. Tämä voi johtua esimerkiksi puuttuvasta palautelomakkeesta.",

  "Search":
  "Etsi",

  "You can use &lt; and &gt; in points columns search fields.":
  "Operaattorit &lt; ja &gt; ovat käytössä pistesarakkeiden haussa.",

  "All":
  "kaikki",

  "Remove":
  "Poista",

  "Ban":
  "Estä",

  "Scroll separately":
  "Vieritä erikseen",

  "Download":
  "Lataa",

  "Ignore trailing whitespace":
  "Ohita loppuvälilyönnit",

  "Are you sure you want to remove the selected deviation? |||| Are you sure you want to remove the %{smart_count} selected deviations?":
  "Haluatko varmasti poistaa valitun poikkeaman? |||| Haluatko varmasti poistaa valitut %{smart_count} poikkeamaa?"
}
